Перем Ф, СписокОшибок, ПолеВвода1;
Перем МассивСвойствВертикальнаяПрокрутка;
Перем МассивСвойствВкладка;
Перем МассивСвойствГлавноеМеню;
Перем МассивСвойствГоризонтальнаяПрокрутка;
Перем МассивСвойствДерево;
Перем МассивСвойствДиалогВыбораКаталога;
Перем МассивСвойствДиалогВыбораЦвета;
Перем МассивСвойствДиалогВыбораШрифта;
Перем МассивСвойствДиалогОткрытияФайла;
Перем МассивСвойствДиалогСохраненияФайла;
Перем МассивСвойствЗначокУведомления;
Перем МассивСвойствИндикаторВертикальный;
Перем МассивСвойствИндикаторГоризонтальный;
Перем МассивСвойствКалендарь;
Перем МассивСвойствКнопка;
Перем МассивСвойствМаскаПоляВвода;
Перем МассивСвойствНаблюдательФайловойСистемы;
Перем МассивСвойствНадпись;
Перем МассивСвойствНадписьСсылка;
Перем МассивСвойствПанель;
Перем МассивСвойствПанельВкладок;
Перем МассивСвойствПанельИнструментов;
Перем МассивСвойствПереключатель;
Перем МассивСвойствПодсказка;
Перем МассивСвойствПолеВвода;
Перем МассивСвойствПолеВыбора;
Перем МассивСвойствПолеКалендаря;
Перем МассивСвойствПолеКартинки;
Перем МассивСвойствПолеСписка;
Перем МассивСвойствПользовательскийЭлементУправления;
Перем МассивСвойствРазделитель;
Перем МассивСвойствРамкаГруппы;
Перем МассивСвойствРегуляторВверхВниз;
Перем МассивСвойствСеткаДанных;
Перем МассивСвойствСеткаСвойств;
Перем МассивСвойствСписокИзображений;
Перем МассивСвойствСписокЭлементов;
Перем МассивСвойствСтрокаСостояния;
Перем МассивСвойствТаблица;
Перем МассивСвойствТаймер;
Перем МассивСвойствФлажок;
Перем МассивСвойствФорматированноеПолеВвода;
Перем МассивСвойствФорма;
Перем КаталогСправки;
Перем ТекПуть;

Функция ОтобратьФайлы(Фильтр)
	// Фильтр = Класс Конструктор Члены Свойства Свойство Методы Метод Перечисление События
	М_Фильтр = Новый Массив;
	ВыбранныеФайлы = НайтиФайлы(КаталогСправки, "*.html", Истина);
	Найдено1 = 0;
	Для А = 0 По ВыбранныеФайлы.ВГраница() Цикл
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ВыбранныеФайлы[А].ПолноеИмя);
		Стр = ТекстДок.ПолучитьТекст();
		МассивСписок1 = Ф.СтрНайтиМежду(Стр, "<H1 class=dtH1", "/H1>", , );
		Если МассивСписок1.Количество > 0 Тогда
			СтрЗаголовка= МассивСписок1.Элемент(0);
			Если (СтрНайти(СтрЗаголовка, Фильтр + "<") > 0) или (СтрНайти(СтрЗаголовка, Фильтр + " <") > 0) Тогда
				Найдено1 = Найдено1 + 1;
				М_Фильтр.Добавить(ВыбранныеФайлы[А].ПолноеИмя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Найдено1 (" + Фильтр + ") = " + Найдено1);
	Возврат М_Фильтр;
КонецФункции

Функция СоздатьСтрокуМассиваСобытий();
	Стр = "М_Событий = Новый Массив();// Массив имен событий." + Символы.ПС;
	М_Событий = Новый Массив();// Массив имен событий.
	ОтобранныеСобытия = ОтобратьФайлы("События");// Из справки отберем файлы с событиями.
	Для А = 0 По ОтобранныеСобытия.ВГраница() Цикл
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ОтобранныеСобытия[А]);
		Стр1 = ТекстДок.ПолучитьТекст();
		МассивСписок1 = Ф.СтрНайтиМежду(Стр1, "<TD width=", "</TD>", , );
		Если МассивСписок1.Количество > 0 Тогда
			Для А1 = 0 По МассивСписок1.Количество - 1 Цикл
				СтрСобытия = МассивСписок1.Элемент(А1);
				МассивСписок2 = Ф.СтрНайтиМежду(СтрСобытия, ".html"">", "(", , );
				Если МассивСписок2.Количество > 0 Тогда
					СтрСобытия = МассивСписок2.Элемент(0);
					СтрСобытия = СтрЗаменить(СтрСобытия, "&nbsp;", "");
					Если М_Событий.Найти(СтрСобытия) = Неопределено Тогда
						М_Событий.Добавить(СтрСобытия);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для А = 0 По М_Событий.ВГраница() Цикл
		Стр = Стр + "М_Событий.Добавить(""" + М_Событий[А] + """);" + Символы.ПС;
	КонецЦикла;
	Возврат СокрЛП(Стр);
КонецФункции//СоздатьСтрокуМассиваСобытий

Процедура СоздатьСпискиСвойств()
	МассивСвойствФорма = Новый СписокЗначений();
		МассивСвойствФорма.Добавить("ToolTip на Подсказка");
		МассивСвойствФорма.Добавить("АвтоПрокрутка");
		МассивСвойствФорма.Добавить("ДвойноеНажатие");
		МассивСвойствФорма.Добавить("Доступность");
		МассивСвойствФорма.Добавить("Закрыта");
		МассивСвойствФорма.Добавить("Значок");
		МассивСвойствФорма.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствФорма.Добавить("КлавишаВверх");
		МассивСвойствФорма.Добавить("КлавишаВниз");
		МассивСвойствФорма.Добавить("КлавишаНажата");
		МассивСвойствФорма.Добавить("КлавишаПредпросмотр");
		МассивСвойствФорма.Добавить("КнопкаМаксимизации");
		МассивСвойствФорма.Добавить("КнопкаМинимизации");
		МассивСвойствФорма.Добавить("КнопкаОтмена");
		МассивСвойствФорма.Добавить("КнопкаПринять");
		МассивСвойствФорма.Добавить("Курсор");
		МассивСвойствФорма.Добавить("МаксимальныйРазмер");
		МассивСвойствФорма.Добавить("Меню");
		МассивСвойствФорма.Добавить("МинимальныйРазмер");
		МассивСвойствФорма.Добавить("МышьНадЭлементом");
		МассивСвойствФорма.Добавить("МышьПокинулаЭлемент");
		МассивСвойствФорма.Добавить("Нажатие");
		МассивСвойствФорма.Добавить("НачальноеПоложение");
		МассивСвойствФорма.Добавить("ОконноеМеню");
		МассивСвойствФорма.Добавить("ОсновнойЦвет");
		МассивСвойствФорма.Добавить("Отображать");
		МассивСвойствФорма.Добавить("ПоверхВсех");
		МассивСвойствФорма.Добавить("ПоказатьВПанели");
		МассивСвойствФорма.Добавить("Положение");
		МассивСвойствФорма.Добавить("ПоложениеИзменено");
		МассивСвойствФорма.Добавить("ПриАктивизации");
		МассивСвойствФорма.Добавить("ПриВходе");
		МассивСвойствФорма.Добавить("ПриДеактивации");
		МассивСвойствФорма.Добавить("ПриЗагрузке");
		МассивСвойствФорма.Добавить("ПриЗадержкеМыши");
		МассивСвойствФорма.Добавить("ПриЗакрытии");
		МассивСвойствФорма.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствФорма.Добавить("ПриОтпусканииМыши");
		МассивСвойствФорма.Добавить("ПриПеремещении");
		МассивСвойствФорма.Добавить("ПриПеремещенииМыши");
		МассивСвойствФорма.Добавить("ПриПерерисовке");
		МассивСвойствФорма.Добавить("ПриПотереФокуса");
		МассивСвойствФорма.Добавить("ПриУходе");
		МассивСвойствФорма.Добавить("ПрозрачныйЦвет");
		МассивСвойствФорма.Добавить("Размер");
		МассивСвойствФорма.Добавить("РазмерИзменен");
		МассивСвойствФорма.Добавить("РазмерПоляАвтоПрокрутки");
		МассивСвойствФорма.Добавить("СтильГраницыФормы");
		МассивСвойствФорма.Добавить("Текст");
		МассивСвойствФорма.Добавить("ТекстИзменен");
		МассивСвойствФорма.Добавить("ФоновоеИзображение");
		МассивСвойствФорма.Добавить("ЦветФона");
		МассивСвойствФорма.Добавить("Шрифт");
		МассивСвойствФорма.Добавить("ЭлементДобавлен");
		МассивСвойствФорма.Добавить("ЭлементУдален");
//=============================================================================================================
	МассивСвойствВертикальнаяПрокрутка = Новый СписокЗначений();
		МассивСвойствВертикальнаяПрокрутка.Добавить("ToolTip на Подсказка");
		МассивСвойствВертикальнаяПрокрутка.Добавить("БольшоеИзменение");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ДвойноеНажатие");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Доступность");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Значение");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ЗначениеИзменено");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствВертикальнаяПрокрутка.Добавить("КлавишаВверх");
		МассивСвойствВертикальнаяПрокрутка.Добавить("КлавишаВниз");
		МассивСвойствВертикальнаяПрокрутка.Добавить("КлавишаНажата");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Курсор");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Максимум");
		МассивСвойствВертикальнаяПрокрутка.Добавить("МалоеИзменение");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Минимум");
		МассивСвойствВертикальнаяПрокрутка.Добавить("МышьНадЭлементом");
		МассивСвойствВертикальнаяПрокрутка.Добавить("МышьПокинулаЭлемент");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Отображать");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Положение");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПоложениеИзменено");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПорядокОбхода");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриВходе");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриЗадержкеМыши");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриОтпусканииМыши");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриПеремещении");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриПеремещенииМыши");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриПерерисовке");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриПотереФокуса");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриПрокручивании");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ПриУходе");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Размер");
		МассивСвойствВертикальнаяПрокрутка.Добавить("РазмерИзменен");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Стыковка");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ТабФокус");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ТекстИзменен");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ЭлементДобавлен");
		МассивСвойствВертикальнаяПрокрутка.Добавить("ЭлементУдален");
		МассивСвойствВертикальнаяПрокрутка.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствГлавноеМеню = Новый СписокЗначений();
		МассивСвойствГлавноеМеню.Добавить("ЭлементыМеню");
//=============================================================================================================
	МассивСвойствГоризонтальнаяПрокрутка = Новый СписокЗначений();
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ToolTip на Подсказка");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("БольшоеИзменение");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ДвойноеНажатие");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Доступность");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Значение");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ЗначениеИзменено");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("КлавишаВверх");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("КлавишаВниз");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("КлавишаНажата");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Курсор");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Максимум");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("МалоеИзменение");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Минимум");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("МышьНадЭлементом");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("МышьПокинулаЭлемент");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Отображать");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Положение");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПоложениеИзменено");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПорядокОбхода");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриВходе");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриЗадержкеМыши");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриОтпусканииМыши");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриПеремещении");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриПеремещенииМыши");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриПерерисовке");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриПотереФокуса");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриПрокручивании");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ПриУходе");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Размер");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("РазмерИзменен");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Стыковка");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ТабФокус");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ТекстИзменен");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ЭлементДобавлен");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("ЭлементУдален");
		МассивСвойствГоризонтальнаяПрокрутка.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствДерево = Новый СписокЗначений();
		МассивСвойствДерево.Добавить("ToolTip на Подсказка");
		МассивСвойствДерево.Добавить("ВысотаЭлемента");
		МассивСвойствДерево.Добавить("Гиперссылка");
		МассивСвойствДерево.Добавить("ДвойноеНажатие");
		МассивСвойствДерево.Добавить("Доступность");
		МассивСвойствДерево.Добавить("ИндексВыбранногоИзображения");
		МассивСвойствДерево.Добавить("ИндексИзображения");
		МассивСвойствДерево.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствДерево.Добавить("КлавишаВверх");
		МассивСвойствДерево.Добавить("КлавишаВниз");
		МассивСвойствДерево.Добавить("КлавишаНажата");
		МассивСвойствДерево.Добавить("Курсор");
		МассивСвойствДерево.Добавить("МышьНадЭлементом");
		МассивСвойствДерево.Добавить("МышьПокинулаЭлемент");
		МассивСвойствДерево.Добавить("Нажатие");
		МассивСвойствДерево.Добавить("ОсновнойЦвет");
		МассивСвойствДерево.Добавить("Отображать");
		МассивСвойствДерево.Добавить("Отступ");
		МассивСвойствДерево.Добавить("ПередРазвертыванием");
		МассивСвойствДерево.Добавить("ПоказатьКорневыеЛинии");
		МассивСвойствДерево.Добавить("ПоказатьЛинии");
		МассивСвойствДерево.Добавить("ПоказатьПлюсМинус");
		МассивСвойствДерево.Добавить("ПолныйВыборСтроки");
		МассивСвойствДерево.Добавить("Положение");
		МассивСвойствДерево.Добавить("ПоложениеИзменено");
		МассивСвойствДерево.Добавить("ПорядокОбхода");
		МассивСвойствДерево.Добавить("ПослеВыбора");
		МассивСвойствДерево.Добавить("ПослеРедактированияНадписи");
		МассивСвойствДерево.Добавить("ПриВходе");
		МассивСвойствДерево.Добавить("ПриЗадержкеМыши");
		МассивСвойствДерево.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствДерево.Добавить("ПриОтпусканииМыши");
		МассивСвойствДерево.Добавить("ПриПеремещении");
		МассивСвойствДерево.Добавить("ПриПеремещенииМыши");
		МассивСвойствДерево.Добавить("ПриПерерисовке");
		МассивСвойствДерево.Добавить("ПриПотереФокуса");
		МассивСвойствДерево.Добавить("ПриУходе");
		МассивСвойствДерево.Добавить("Прокручиваемый");
		МассивСвойствДерево.Добавить("РазделительПути");
		МассивСвойствДерево.Добавить("Размер");
		МассивСвойствДерево.Добавить("РазмерИзменен");
		МассивСвойствДерево.Добавить("РедактированиеНадписи");
		МассивСвойствДерево.Добавить("СкрытьВыделение");
		МассивСвойствДерево.Добавить("СписокИзображений");
		МассивСвойствДерево.Добавить("СтильГраницы");
		МассивСвойствДерево.Добавить("Стыковка");
		МассивСвойствДерево.Добавить("ТабФокус");
		МассивСвойствДерево.Добавить("ТекстИзменен");
		МассивСвойствДерево.Добавить("Узлы");
		МассивСвойствДерево.Добавить("Флажки");
		МассивСвойствДерево.Добавить("ЦветФона");
		МассивСвойствДерево.Добавить("Шрифт");
		МассивСвойствДерево.Добавить("ЭлементДобавлен");
		МассивСвойствДерево.Добавить("ЭлементУдален");
		МассивСвойствДерево.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствДиалогВыбораКаталога = Новый СписокЗначений();
		МассивСвойствДиалогВыбораКаталога.Добавить("ВыбранныйПуть");
		МассивСвойствДиалогВыбораКаталога.Добавить("КорневойКаталог");
		МассивСвойствДиалогВыбораКаталога.Добавить("Описание");
		МассивСвойствДиалогВыбораКаталога.Добавить("ПоказатьКнопкуНовогоКаталога");
//=============================================================================================================
	МассивСвойствДиалогВыбораЦвета = Новый СписокЗначений();
		МассивСвойствДиалогВыбораЦвета.Добавить("Цвет");
//=============================================================================================================
	МассивСвойствДиалогВыбораШрифта = Новый СписокЗначений();
		МассивСвойствДиалогВыбораШрифта.Добавить("Цвет");
		МассивСвойствДиалогВыбораШрифта.Добавить("Шрифт");
//=============================================================================================================
	МассивСвойствДиалогОткрытияФайла = Новый СписокЗначений();
		МассивСвойствДиалогОткрытияФайла.Добавить("ВосстанавливатьКаталог");
		МассивСвойствДиалогОткрытияФайла.Добавить("ДобавитьРасширение");
		МассивСвойствДиалогОткрытияФайла.Добавить("Заголовок");
		МассивСвойствДиалогОткрытияФайла.Добавить("ИмяФайла");
		МассивСвойствДиалогОткрытияФайла.Добавить("ИндексФильтра");
		МассивСвойствДиалогОткрытияФайла.Добавить("НачальныйКаталог");
		МассивСвойствДиалогОткрытияФайла.Добавить("ПоказатьТолькоДляЧтения");
		МассивСвойствДиалогОткрытияФайла.Добавить("ПомеченТолькоЧтение");
		МассивСвойствДиалогОткрытияФайла.Добавить("ПроверятьСуществованиеПути");
		МассивСвойствДиалогОткрытияФайла.Добавить("ПроверятьСуществованиеФайла");
		МассивСвойствДиалогОткрытияФайла.Добавить("РазыменоватьСсылки");
		МассивСвойствДиалогОткрытияФайла.Добавить("РасширениеПоУмолчанию");
		МассивСвойствДиалогОткрытияФайла.Добавить("Фильтр");
//=============================================================================================================
	МассивСвойствДиалогСохраненияФайла = Новый СписокЗначений();
		МассивСвойствДиалогСохраненияФайла.Добавить("ВосстанавливатьКаталог");
		МассивСвойствДиалогСохраненияФайла.Добавить("ДобавитьРасширение");
		МассивСвойствДиалогСохраненияФайла.Добавить("Заголовок");
		МассивСвойствДиалогСохраненияФайла.Добавить("ИмяФайла");
		МассивСвойствДиалогСохраненияФайла.Добавить("ИндексФильтра");
		МассивСвойствДиалогСохраненияФайла.Добавить("НачальныйКаталог");
		МассивСвойствДиалогСохраненияФайла.Добавить("ПодтверждениеПерезаписи");
		МассивСвойствДиалогСохраненияФайла.Добавить("ПодтверждениеСоздания");
		МассивСвойствДиалогСохраненияФайла.Добавить("ПроверятьСуществованиеПути");
		МассивСвойствДиалогСохраненияФайла.Добавить("ПроверятьСуществованиеФайла");
		МассивСвойствДиалогСохраненияФайла.Добавить("РазыменоватьСсылки");
		МассивСвойствДиалогСохраненияФайла.Добавить("РасширениеПоУмолчанию");
		МассивСвойствДиалогСохраненияФайла.Добавить("Фильтр");
//=============================================================================================================
	МассивСвойствЗначокУведомления = Новый СписокЗначений();
		МассивСвойствЗначокУведомления.Добавить("ДвойноеНажатие");
		МассивСвойствЗначокУведомления.Добавить("Значок");
		МассивСвойствЗначокУведомления.Добавить("Нажатие");
		МассивСвойствЗначокУведомления.Добавить("Отображать");
		МассивСвойствЗначокУведомления.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствЗначокУведомления.Добавить("ПриОтпусканииМыши");
		МассивСвойствЗначокУведомления.Добавить("ПриПеремещенииМыши");
		МассивСвойствЗначокУведомления.Добавить("Текст");
//=============================================================================================================
	МассивСвойствИндикаторВертикальный = Новый СписокЗначений();
		МассивСвойствИндикаторВертикальный.Добавить("ToolTip на Подсказка");
		МассивСвойствИндикаторВертикальный.Добавить("ДвойноеНажатие");
		МассивСвойствИндикаторВертикальный.Добавить("Доступность");
		МассивСвойствИндикаторВертикальный.Добавить("Значение");
		МассивСвойствИндикаторВертикальный.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствИндикаторВертикальный.Добавить("КлавишаВверх");
		МассивСвойствИндикаторВертикальный.Добавить("КлавишаВниз");
		МассивСвойствИндикаторВертикальный.Добавить("КлавишаНажата");
		МассивСвойствИндикаторВертикальный.Добавить("Курсор");
		МассивСвойствИндикаторВертикальный.Добавить("Максимум");
		МассивСвойствИндикаторВертикальный.Добавить("Минимум");
		МассивСвойствИндикаторВертикальный.Добавить("МышьНадЭлементом");
		МассивСвойствИндикаторВертикальный.Добавить("МышьПокинулаЭлемент");
		МассивСвойствИндикаторВертикальный.Добавить("Нажатие");
		МассивСвойствИндикаторВертикальный.Добавить("ОсновнойЦвет");
		МассивСвойствИндикаторВертикальный.Добавить("Отображать");
		МассивСвойствИндикаторВертикальный.Добавить("Положение");
		МассивСвойствИндикаторВертикальный.Добавить("ПоложениеИзменено");
		МассивСвойствИндикаторВертикальный.Добавить("ПорядокОбхода");
		МассивСвойствИндикаторВертикальный.Добавить("ПриВходе");
		МассивСвойствИндикаторВертикальный.Добавить("ПриЗадержкеМыши");
		МассивСвойствИндикаторВертикальный.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствИндикаторВертикальный.Добавить("ПриОтпусканииМыши");
		МассивСвойствИндикаторВертикальный.Добавить("ПриПеремещении");
		МассивСвойствИндикаторВертикальный.Добавить("ПриПеремещенииМыши");
		МассивСвойствИндикаторВертикальный.Добавить("ПриПерерисовке");
		МассивСвойствИндикаторВертикальный.Добавить("ПриПотереФокуса");
		МассивСвойствИндикаторВертикальный.Добавить("ПриУходе");
		МассивСвойствИндикаторВертикальный.Добавить("Размер");
		МассивСвойствИндикаторВертикальный.Добавить("РазмерИзменен");
		МассивСвойствИндикаторВертикальный.Добавить("Стыковка");
		МассивСвойствИндикаторВертикальный.Добавить("ТекстИзменен");
		МассивСвойствИндикаторВертикальный.Добавить("ЦветФона");
		МассивСвойствИндикаторВертикальный.Добавить("ЭлементДобавлен");
		МассивСвойствИндикаторВертикальный.Добавить("ЭлементУдален");
		МассивСвойствИндикаторВертикальный.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствИндикаторГоризонтальный = Новый СписокЗначений();
		МассивСвойствИндикаторГоризонтальный.Добавить("ToolTip на Подсказка");
		МассивСвойствИндикаторГоризонтальный.Добавить("ДвойноеНажатие");
		МассивСвойствИндикаторГоризонтальный.Добавить("Доступность");
		МассивСвойствИндикаторГоризонтальный.Добавить("Значение");
		МассивСвойствИндикаторГоризонтальный.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствИндикаторГоризонтальный.Добавить("КлавишаВверх");
		МассивСвойствИндикаторГоризонтальный.Добавить("КлавишаВниз");
		МассивСвойствИндикаторГоризонтальный.Добавить("КлавишаНажата");
		МассивСвойствИндикаторГоризонтальный.Добавить("Курсор");
		МассивСвойствИндикаторГоризонтальный.Добавить("Максимум");
		МассивСвойствИндикаторГоризонтальный.Добавить("Минимум");
		МассивСвойствИндикаторГоризонтальный.Добавить("МышьНадЭлементом");
		МассивСвойствИндикаторГоризонтальный.Добавить("МышьПокинулаЭлемент");
		МассивСвойствИндикаторГоризонтальный.Добавить("Нажатие");
		МассивСвойствИндикаторГоризонтальный.Добавить("ОсновнойЦвет");
		МассивСвойствИндикаторГоризонтальный.Добавить("Отображать");
		МассивСвойствИндикаторГоризонтальный.Добавить("Положение");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПоложениеИзменено");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПорядокОбхода");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПриВходе");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПриЗадержкеМыши");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПриОтпусканииМыши");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПриПеремещении");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПриПеремещенииМыши");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПриПерерисовке");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПриПотереФокуса");
		МассивСвойствИндикаторГоризонтальный.Добавить("ПриУходе");
		МассивСвойствИндикаторГоризонтальный.Добавить("Размер");
		МассивСвойствИндикаторГоризонтальный.Добавить("РазмерИзменен");
		МассивСвойствИндикаторГоризонтальный.Добавить("Стыковка");
		МассивСвойствИндикаторГоризонтальный.Добавить("ТекстИзменен");
		МассивСвойствИндикаторГоризонтальный.Добавить("ЦветФона");
		МассивСвойствИндикаторГоризонтальный.Добавить("ЭлементДобавлен");
		МассивСвойствИндикаторГоризонтальный.Добавить("ЭлементУдален");
		МассивСвойствИндикаторГоризонтальный.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствКалендарь = Новый СписокЗначений();
		МассивСвойствКалендарь.Добавить("ToolTip на Подсказка");
		МассивСвойствКалендарь.Добавить("ВыделенныеДаты");
		МассивСвойствКалендарь.Добавить("ВыделенныйДиапазон");
		МассивСвойствКалендарь.Добавить("ДатаВыбрана");
		МассивСвойствКалендарь.Добавить("ДатаИзменена");
		МассивСвойствКалендарь.Добавить("ДвойноеНажатие");
		МассивСвойствКалендарь.Добавить("Доступность");
		МассивСвойствКалендарь.Добавить("ЕжегодныеДаты");
		МассивСвойствКалендарь.Добавить("ЕжемесячныеДаты");
		МассивСвойствКалендарь.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствКалендарь.Добавить("КлавишаВверх");
		МассивСвойствКалендарь.Добавить("КлавишаВниз");
		МассивСвойствКалендарь.Добавить("КлавишаНажата");
		МассивСвойствКалендарь.Добавить("Курсор");
		МассивСвойствКалендарь.Добавить("МаксимальнаяДата");
		МассивСвойствКалендарь.Добавить("МаксимумВыбранных");
		МассивСвойствКалендарь.Добавить("МинимальнаяДата");
		МассивСвойствКалендарь.Добавить("МышьНадЭлементом");
		МассивСвойствКалендарь.Добавить("МышьПокинулаЭлемент");
		МассивСвойствКалендарь.Добавить("Нажатие");
		МассивСвойствКалендарь.Добавить("ОбвестиТекущуюДату");
		МассивСвойствКалендарь.Добавить("ОсновнойЦвет");
		МассивСвойствКалендарь.Добавить("Отображать");
		МассивСвойствКалендарь.Добавить("ПервыйДеньНедели");
		МассивСвойствКалендарь.Добавить("ПоказатьТекущуюДату");
		МассивСвойствКалендарь.Добавить("Положение");
		МассивСвойствКалендарь.Добавить("ПоложениеИзменено");
		МассивСвойствКалендарь.Добавить("ПорядокОбхода");
		МассивСвойствКалендарь.Добавить("ПриВходе");
		МассивСвойствКалендарь.Добавить("ПриЗадержкеМыши");
		МассивСвойствКалендарь.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствКалендарь.Добавить("ПриОтпусканииМыши");
		МассивСвойствКалендарь.Добавить("ПриПеремещении");
		МассивСвойствКалендарь.Добавить("ПриПеремещенииМыши");
		МассивСвойствКалендарь.Добавить("ПриПерерисовке");
		МассивСвойствКалендарь.Добавить("ПриПотереФокуса");
		МассивСвойствКалендарь.Добавить("ПриУходе");
		МассивСвойствКалендарь.Добавить("Размер");
		МассивСвойствКалендарь.Добавить("РазмерИзменен");
		МассивСвойствКалендарь.Добавить("Стыковка");
		МассивСвойствКалендарь.Добавить("ТабФокус");
		МассивСвойствКалендарь.Добавить("ТекущаяДата");
		МассивСвойствКалендарь.Добавить("ЦветФона");
		МассивСвойствКалендарь.Добавить("Шрифт");
		МассивСвойствКалендарь.Добавить("ЭлементДобавлен");
		МассивСвойствКалендарь.Добавить("ЭлементУдален");
		МассивСвойствКалендарь.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствКнопка = Новый СписокЗначений();
		МассивСвойствКнопка.Добавить("ToolTip на Подсказка");
		МассивСвойствКнопка.Добавить("ВыравниваниеИзображения");
		МассивСвойствКнопка.Добавить("ВыравниваниеТекста");
		МассивСвойствКнопка.Добавить("ДвойноеНажатие");
		МассивСвойствКнопка.Добавить("Доступность");
		МассивСвойствКнопка.Добавить("Изображение");
		МассивСвойствКнопка.Добавить("ИндексИзображения");
		МассивСвойствКнопка.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствКнопка.Добавить("КлавишаВверх");
		МассивСвойствКнопка.Добавить("КлавишаВниз");
		МассивСвойствКнопка.Добавить("КлавишаНажата");
		МассивСвойствКнопка.Добавить("Курсор");
		МассивСвойствКнопка.Добавить("МышьНадЭлементом");
		МассивСвойствКнопка.Добавить("МышьПокинулаЭлемент");
		МассивСвойствКнопка.Добавить("Нажатие");
		МассивСвойствКнопка.Добавить("ОсновнойЦвет");
		МассивСвойствКнопка.Добавить("Отображать");
		МассивСвойствКнопка.Добавить("ПлоскийСтиль");
		МассивСвойствКнопка.Добавить("Положение");
		МассивСвойствКнопка.Добавить("ПоложениеИзменено");
		МассивСвойствКнопка.Добавить("ПорядокОбхода");
		МассивСвойствКнопка.Добавить("ПриВходе");
		МассивСвойствКнопка.Добавить("ПриЗадержкеМыши");
		МассивСвойствКнопка.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствКнопка.Добавить("ПриОтпусканииМыши");
		МассивСвойствКнопка.Добавить("ПриПеремещении");
		МассивСвойствКнопка.Добавить("ПриПеремещенииМыши");
		МассивСвойствКнопка.Добавить("ПриПерерисовке");
		МассивСвойствКнопка.Добавить("ПриПотереФокуса");
		МассивСвойствКнопка.Добавить("ПриУходе");
		МассивСвойствКнопка.Добавить("Размер");
		МассивСвойствКнопка.Добавить("РазмерИзменен");
		МассивСвойствКнопка.Добавить("РезультатДиалога");
		МассивСвойствКнопка.Добавить("СписокИзображений");
		МассивСвойствКнопка.Добавить("Стыковка");
		МассивСвойствКнопка.Добавить("ТабФокус");
		МассивСвойствКнопка.Добавить("Текст");
		МассивСвойствКнопка.Добавить("ТекстИзменен");
		МассивСвойствКнопка.Добавить("ФоновоеИзображение");
		МассивСвойствКнопка.Добавить("ЦветФона");
		МассивСвойствКнопка.Добавить("Шрифт");
		МассивСвойствКнопка.Добавить("ЭлементДобавлен");
		МассивСвойствКнопка.Добавить("ЭлементУдален");
		МассивСвойствКнопка.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствМаскаПоляВвода = Новый СписокЗначений();
		МассивСвойствМаскаПоляВвода.Добавить("ToolTip на Подсказка");
		МассивСвойствМаскаПоляВвода.Добавить("ВводОтклонен");
		МассивСвойствМаскаПоляВвода.Добавить("ВыравниваниеТекста");
		МассивСвойствМаскаПоляВвода.Добавить("ДвойноеНажатие");
		МассивСвойствМаскаПоляВвода.Добавить("Доступность");
		МассивСвойствМаскаПоляВвода.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствМаскаПоляВвода.Добавить("ИспользоватьСимволПриглашения");
		МассивСвойствМаскаПоляВвода.Добавить("ИспользоватьСистемныйСимволПароля");
		МассивСвойствМаскаПоляВвода.Добавить("КлавишаВверх");
		МассивСвойствМаскаПоляВвода.Добавить("КлавишаВниз");
		МассивСвойствМаскаПоляВвода.Добавить("КлавишаНажата");
		МассивСвойствМаскаПоляВвода.Добавить("КопироватьМаску");
		МассивСвойствМаскаПоляВвода.Добавить("Курсор");
		МассивСвойствМаскаПоляВвода.Добавить("Маска");
		МассивСвойствМаскаПоляВвода.Добавить("МышьНадЭлементом");
		МассивСвойствМаскаПоляВвода.Добавить("МышьПокинулаЭлемент");
		МассивСвойствМаскаПоляВвода.Добавить("Нажатие");
		МассивСвойствМаскаПоляВвода.Добавить("ОсновнойЦвет");
		МассивСвойствМаскаПоляВвода.Добавить("Отображать");
		МассивСвойствМаскаПоляВвода.Добавить("Положение");
		МассивСвойствМаскаПоляВвода.Добавить("ПоложениеИзменено");
		МассивСвойствМаскаПоляВвода.Добавить("ПорядокОбхода");
		МассивСвойствМаскаПоляВвода.Добавить("ПриВходе");
		МассивСвойствМаскаПоляВвода.Добавить("ПриЗадержкеМыши");
		МассивСвойствМаскаПоляВвода.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствМаскаПоляВвода.Добавить("ПриОтпусканииМыши");
		МассивСвойствМаскаПоляВвода.Добавить("ПриПеремещении");
		МассивСвойствМаскаПоляВвода.Добавить("ПриПеремещенииМыши");
		МассивСвойствМаскаПоляВвода.Добавить("ПриПерерисовке");
		МассивСвойствМаскаПоляВвода.Добавить("ПриПотереФокуса");
		МассивСвойствМаскаПоляВвода.Добавить("ПриУходе");
		МассивСвойствМаскаПоляВвода.Добавить("ПропускЛитералов");
		МассивСвойствМаскаПоляВвода.Добавить("Размер");
		МассивСвойствМаскаПоляВвода.Добавить("РазмерИзменен");
		МассивСвойствМаскаПоляВвода.Добавить("РежимВставки");
		МассивСвойствМаскаПоляВвода.Добавить("СбросНаПробел");
		МассивСвойствМаскаПоляВвода.Добавить("СбросНаСимволПриглашения");
		МассивСвойствМаскаПоляВвода.Добавить("СигналОтклоненного");
		МассивСвойствМаскаПоляВвода.Добавить("СимволПароля");
		МассивСвойствМаскаПоляВвода.Добавить("СимволПриглашения");
		МассивСвойствМаскаПоляВвода.Добавить("СкрыватьМаскуПриУходе");
		МассивСвойствМаскаПоляВвода.Добавить("СкрытьВыделение");
		МассивСвойствМаскаПоляВвода.Добавить("СтильГраницы");
		МассивСвойствМаскаПоляВвода.Добавить("Стыковка");
		МассивСвойствМаскаПоляВвода.Добавить("ТабФокус");
		МассивСвойствМаскаПоляВвода.Добавить("Текст");
		МассивСвойствМаскаПоляВвода.Добавить("ТекстИзменен");
		МассивСвойствМаскаПоляВвода.Добавить("ТолькоASCII");
		МассивСвойствМаскаПоляВвода.Добавить("ТолькоЧтение");
		МассивСвойствМаскаПоляВвода.Добавить("ФорматМаски");
		МассивСвойствМаскаПоляВвода.Добавить("ЦветФона");
		МассивСвойствМаскаПоляВвода.Добавить("Шрифт");
		МассивСвойствМаскаПоляВвода.Добавить("ЭлементДобавлен");
		МассивСвойствМаскаПоляВвода.Добавить("ЭлементУдален");
		МассивСвойствМаскаПоляВвода.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствНаблюдательФайловойСистемы = Новый СписокЗначений();
		МассивСвойствНаблюдательФайловойСистемы.Добавить("ВключаяПодкаталоги");
		МассивСвойствНаблюдательФайловойСистемы.Добавить("КомпонентДоступен");
		МассивСвойствНаблюдательФайловойСистемы.Добавить("ПриИзменении");
		МассивСвойствНаблюдательФайловойСистемы.Добавить("ПриПереименовании");
		МассивСвойствНаблюдательФайловойСистемы.Добавить("ПриСоздании");
		МассивСвойствНаблюдательФайловойСистемы.Добавить("ПриУдалении");
		МассивСвойствНаблюдательФайловойСистемы.Добавить("Путь");
		МассивСвойствНаблюдательФайловойСистемы.Добавить("Фильтр");
		МассивСвойствНаблюдательФайловойСистемы.Добавить("ФильтрУведомлений");
//=============================================================================================================
	МассивСвойствНадпись = Новый СписокЗначений();
		МассивСвойствНадпись.Добавить("ToolTip на Подсказка");
		МассивСвойствНадпись.Добавить("АвтоРазмер");
		МассивСвойствНадпись.Добавить("ВыравниваниеИзображения");
		МассивСвойствНадпись.Добавить("ВыравниваниеТекста");
		МассивСвойствНадпись.Добавить("ДвойноеНажатие");
		МассивСвойствНадпись.Добавить("Доступность");
		МассивСвойствНадпись.Добавить("Изображение");
		МассивСвойствНадпись.Добавить("ИндексИзображения");
		МассивСвойствНадпись.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствНадпись.Добавить("КлавишаВверх");
		МассивСвойствНадпись.Добавить("КлавишаВниз");
		МассивСвойствНадпись.Добавить("КлавишаНажата");
		МассивСвойствНадпись.Добавить("Курсор");
		МассивСвойствНадпись.Добавить("МышьНадЭлементом");
		МассивСвойствНадпись.Добавить("МышьПокинулаЭлемент");
		МассивСвойствНадпись.Добавить("Нажатие");
		МассивСвойствНадпись.Добавить("ОсновнойЦвет");
		МассивСвойствНадпись.Добавить("Отображать");
		МассивСвойствНадпись.Добавить("Положение");
		МассивСвойствНадпись.Добавить("ПоложениеИзменено");
		МассивСвойствНадпись.Добавить("ПорядокОбхода");
		МассивСвойствНадпись.Добавить("ПриВходе");
		МассивСвойствНадпись.Добавить("ПриЗадержкеМыши");
		МассивСвойствНадпись.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствНадпись.Добавить("ПриОтпусканииМыши");
		МассивСвойствНадпись.Добавить("ПриПеремещении");
		МассивСвойствНадпись.Добавить("ПриПеремещенииМыши");
		МассивСвойствНадпись.Добавить("ПриПерерисовке");
		МассивСвойствНадпись.Добавить("ПриПотереФокуса");
		МассивСвойствНадпись.Добавить("ПриУходе");
		МассивСвойствНадпись.Добавить("Размер");
		МассивСвойствНадпись.Добавить("РазмерИзменен");
		МассивСвойствНадпись.Добавить("СписокИзображений");
		МассивСвойствНадпись.Добавить("СтильГраницы");
		МассивСвойствНадпись.Добавить("Стыковка");
		МассивСвойствНадпись.Добавить("Текст");
		МассивСвойствНадпись.Добавить("ТекстИзменен");
		МассивСвойствНадпись.Добавить("ЦветФона");
		МассивСвойствНадпись.Добавить("Шрифт");
		МассивСвойствНадпись.Добавить("ЭлементДобавлен");
		МассивСвойствНадпись.Добавить("ЭлементУдален");
		МассивСвойствНадпись.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствНадписьСсылка = Новый СписокЗначений();
		МассивСвойствНадписьСсылка.Добавить("ToolTip на Подсказка");
		МассивСвойствНадписьСсылка.Добавить("АвтоРазмер");
		МассивСвойствНадписьСсылка.Добавить("ВыравниваниеИзображения");
		МассивСвойствНадписьСсылка.Добавить("ВыравниваниеТекста");
		МассивСвойствНадписьСсылка.Добавить("ДвойноеНажатие");
		МассивСвойствНадписьСсылка.Добавить("Доступность");
		МассивСвойствНадписьСсылка.Добавить("Изображение");
		МассивСвойствНадписьСсылка.Добавить("ИндексИзображения");
		МассивСвойствНадписьСсылка.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствНадписьСсылка.Добавить("КлавишаВверх");
		МассивСвойствНадписьСсылка.Добавить("КлавишаВниз");
		МассивСвойствНадписьСсылка.Добавить("КлавишаНажата");
		МассивСвойствНадписьСсылка.Добавить("Курсор");
		МассивСвойствНадписьСсылка.Добавить("МышьНадЭлементом");
		МассивСвойствНадписьСсылка.Добавить("МышьПокинулаЭлемент");
		МассивСвойствНадписьСсылка.Добавить("Нажатие");
		МассивСвойствНадписьСсылка.Добавить("ОбластьСсылки");
		МассивСвойствНадписьСсылка.Добавить("ОсновнойЦвет");
		МассивСвойствНадписьСсылка.Добавить("Отображать");
		МассивСвойствНадписьСсылка.Добавить("ПоведениеСсылки");
		МассивСвойствНадписьСсылка.Добавить("Положение");
		МассивСвойствНадписьСсылка.Добавить("ПоложениеИзменено");
		МассивСвойствНадписьСсылка.Добавить("ПорядокОбхода");
		МассивСвойствНадписьСсылка.Добавить("ПриВходе");
		МассивСвойствНадписьСсылка.Добавить("ПриЗадержкеМыши");
		МассивСвойствНадписьСсылка.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствНадписьСсылка.Добавить("ПриОтпусканииМыши");
		МассивСвойствНадписьСсылка.Добавить("ПриПеремещении");
		МассивСвойствНадписьСсылка.Добавить("ПриПеремещенииМыши");
		МассивСвойствНадписьСсылка.Добавить("ПриПерерисовке");
		МассивСвойствНадписьСсылка.Добавить("ПриПотереФокуса");
		МассивСвойствНадписьСсылка.Добавить("ПриУходе");
		МассивСвойствНадписьСсылка.Добавить("Размер");
		МассивСвойствНадписьСсылка.Добавить("РазмерИзменен");
		МассивСвойствНадписьСсылка.Добавить("СписокИзображений");
		МассивСвойствНадписьСсылка.Добавить("СсылкаНажата");
		МассивСвойствНадписьСсылка.Добавить("СсылкаПосещена");
		МассивСвойствНадписьСсылка.Добавить("СтильГраницы");
		МассивСвойствНадписьСсылка.Добавить("Стыковка");
		МассивСвойствНадписьСсылка.Добавить("ТабФокус");
		МассивСвойствНадписьСсылка.Добавить("Текст");
		МассивСвойствНадписьСсылка.Добавить("ТекстИзменен");
		МассивСвойствНадписьСсылка.Добавить("ЦветАктивнойСсылки");
		МассивСвойствНадписьСсылка.Добавить("ЦветПосещеннойСсылки");
		МассивСвойствНадписьСсылка.Добавить("ЦветСсылки");
		МассивСвойствНадписьСсылка.Добавить("ЦветФона");
		МассивСвойствНадписьСсылка.Добавить("Шрифт");
		МассивСвойствНадписьСсылка.Добавить("ЭлементДобавлен");
		МассивСвойствНадписьСсылка.Добавить("ЭлементУдален");
		МассивСвойствНадписьСсылка.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствПанель = Новый СписокЗначений();
		МассивСвойствПанель.Добавить("ToolTip на Подсказка");
		МассивСвойствПанель.Добавить("АвтоПрокрутка");
		МассивСвойствПанель.Добавить("ДвойноеНажатие");
		МассивСвойствПанель.Добавить("Доступность");
		МассивСвойствПанель.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПанель.Добавить("КлавишаВверх");
		МассивСвойствПанель.Добавить("КлавишаВниз");
		МассивСвойствПанель.Добавить("КлавишаНажата");
		МассивСвойствПанель.Добавить("Курсор");
		МассивСвойствПанель.Добавить("МышьНадЭлементом");
		МассивСвойствПанель.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПанель.Добавить("Нажатие");
		МассивСвойствПанель.Добавить("ОсновнойЦвет");
		МассивСвойствПанель.Добавить("Отображать");
		МассивСвойствПанель.Добавить("Положение");
		МассивСвойствПанель.Добавить("ПоложениеИзменено");
		МассивСвойствПанель.Добавить("ПорядокОбхода");
		МассивСвойствПанель.Добавить("ПриВходе");
		МассивСвойствПанель.Добавить("ПриЗадержкеМыши");
		МассивСвойствПанель.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПанель.Добавить("ПриОтпусканииМыши");
		МассивСвойствПанель.Добавить("ПриПеремещении");
		МассивСвойствПанель.Добавить("ПриПеремещенииМыши");
		МассивСвойствПанель.Добавить("ПриПерерисовке");
		МассивСвойствПанель.Добавить("ПриПотереФокуса");
		МассивСвойствПанель.Добавить("ПриУходе");
		МассивСвойствПанель.Добавить("Размер");
		МассивСвойствПанель.Добавить("РазмерИзменен");
		МассивСвойствПанель.Добавить("РазмерПоляАвтоПрокрутки");
		МассивСвойствПанель.Добавить("СтильГраницы");
		МассивСвойствПанель.Добавить("Стыковка");
		МассивСвойствПанель.Добавить("ТабФокус");
		МассивСвойствПанель.Добавить("ТекстИзменен");
		МассивСвойствПанель.Добавить("ФоновоеИзображение");
		МассивСвойствПанель.Добавить("ЦветФона");
		МассивСвойствПанель.Добавить("Шрифт");
		МассивСвойствПанель.Добавить("ЭлементДобавлен");
		МассивСвойствПанель.Добавить("ЭлементУдален");
		МассивСвойствПанель.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствПанельВкладок = Новый СписокЗначений();
		МассивСвойствПанельВкладок.Добавить("ToolTip на Подсказка");
		МассивСвойствПанельВкладок.Добавить("Вкладки");
		МассивСвойствПанельВкладок.Добавить("Выравнивание");
		МассивСвойствПанельВкладок.Добавить("ДвойноеНажатие");
		МассивСвойствПанельВкладок.Добавить("Доступность");
		МассивСвойствПанельВкладок.Добавить("ИндексВыбранногоИзменен");
		МассивСвойствПанельВкладок.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПанельВкладок.Добавить("КлавишаВверх");
		МассивСвойствПанельВкладок.Добавить("КлавишаВниз");
		МассивСвойствПанельВкладок.Добавить("КлавишаНажата");
		МассивСвойствПанельВкладок.Добавить("Курсор");
		МассивСвойствПанельВкладок.Добавить("МногострочныйРежим");
		МассивСвойствПанельВкладок.Добавить("МышьНадЭлементом");
		МассивСвойствПанельВкладок.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПанельВкладок.Добавить("Нажатие");
		МассивСвойствПанельВкладок.Добавить("Отображать");
		МассивСвойствПанельВкладок.Добавить("Оформление");
		МассивСвойствПанельВкладок.Добавить("ПоказатьПодсказку");
		МассивСвойствПанельВкладок.Добавить("Положение");
		МассивСвойствПанельВкладок.Добавить("ПоложениеИзменено");
		МассивСвойствПанельВкладок.Добавить("ПорядокОбхода");
		МассивСвойствПанельВкладок.Добавить("ПриВходе");
		МассивСвойствПанельВкладок.Добавить("ПриЗадержкеМыши");
		МассивСвойствПанельВкладок.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПанельВкладок.Добавить("ПриОтпусканииМыши");
		МассивСвойствПанельВкладок.Добавить("ПриПеремещении");
		МассивСвойствПанельВкладок.Добавить("ПриПеремещенииМыши");
		МассивСвойствПанельВкладок.Добавить("ПриПерерисовке");
		МассивСвойствПанельВкладок.Добавить("ПриПотереФокуса");
		МассивСвойствПанельВкладок.Добавить("ПриУходе");
		МассивСвойствПанельВкладок.Добавить("Размер");
		МассивСвойствПанельВкладок.Добавить("РазмерИзменен");
		МассивСвойствПанельВкладок.Добавить("РазмерЭлемента");
		МассивСвойствПанельВкладок.Добавить("РежимМасштабирования");
		МассивСвойствПанельВкладок.Добавить("СписокИзображений");
		МассивСвойствПанельВкладок.Добавить("Стыковка");
		МассивСвойствПанельВкладок.Добавить("ТабФокус");
		МассивСвойствПанельВкладок.Добавить("ТекстИзменен");
		МассивСвойствПанельВкладок.Добавить("Шрифт");
		МассивСвойствПанельВкладок.Добавить("ЭлементДобавлен");
		МассивСвойствПанельВкладок.Добавить("ЭлементУдален");
		МассивСвойствПанельВкладок.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствВкладка = Новый СписокЗначений();
		МассивСвойствВкладка.Добавить("АвтоПрокрутка");
		МассивСвойствВкладка.Добавить("ДвойноеНажатие");
		МассивСвойствВкладка.Добавить("ИндексИзображения");
		МассивСвойствВкладка.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствВкладка.Добавить("КлавишаВверх");
		МассивСвойствВкладка.Добавить("КлавишаВниз");
		МассивСвойствВкладка.Добавить("КлавишаНажата");
		МассивСвойствВкладка.Добавить("Курсор");
		МассивСвойствВкладка.Добавить("МышьНадЭлементом");
		МассивСвойствВкладка.Добавить("МышьПокинулаЭлемент");
		МассивСвойствВкладка.Добавить("Нажатие");
		МассивСвойствВкладка.Добавить("ОсновнойЦвет");
		МассивСвойствВкладка.Добавить("ПоложениеИзменено");
		МассивСвойствВкладка.Добавить("ПриВходе");
		МассивСвойствВкладка.Добавить("ПриЗадержкеМыши");
		МассивСвойствВкладка.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствВкладка.Добавить("ПриОтпусканииМыши");
		МассивСвойствВкладка.Добавить("ПриПеремещении");
		МассивСвойствВкладка.Добавить("ПриПеремещенииМыши");
		МассивСвойствВкладка.Добавить("ПриПерерисовке");
		МассивСвойствВкладка.Добавить("ПриПотереФокуса");
		МассивСвойствВкладка.Добавить("ПриУходе");
		МассивСвойствВкладка.Добавить("РазмерИзменен");
		МассивСвойствВкладка.Добавить("РазмерПоляАвтоПрокрутки");
		МассивСвойствВкладка.Добавить("СтильГраницы");
		МассивСвойствВкладка.Добавить("Текст");
		МассивСвойствВкладка.Добавить("ТекстИзменен");
		МассивСвойствВкладка.Добавить("ТекстПодсказки");
		МассивСвойствВкладка.Добавить("ФоновоеИзображение");
		МассивСвойствВкладка.Добавить("ЦветФона");
		МассивСвойствВкладка.Добавить("Шрифт");
		МассивСвойствВкладка.Добавить("ЭлементДобавлен");
		МассивСвойствВкладка.Добавить("ЭлементУдален");
//=============================================================================================================
	МассивСвойствПанельИнструментов = Новый СписокЗначений();
		МассивСвойствПанельИнструментов.Добавить("ToolTip на Подсказка");
		МассивСвойствПанельИнструментов.Добавить("АвтоРазмер");
		МассивСвойствПанельИнструментов.Добавить("ВыравниваниеТекста");
		МассивСвойствПанельИнструментов.Добавить("ДвойноеНажатие");
		МассивСвойствПанельИнструментов.Добавить("Доступность");
		МассивСвойствПанельИнструментов.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПанельИнструментов.Добавить("КлавишаВверх");
		МассивСвойствПанельИнструментов.Добавить("КлавишаВниз");
		МассивСвойствПанельИнструментов.Добавить("КлавишаНажата");
		МассивСвойствПанельИнструментов.Добавить("Кнопки");
		МассивСвойствПанельИнструментов.Добавить("Курсор");
		МассивСвойствПанельИнструментов.Добавить("МышьНадЭлементом");
		МассивСвойствПанельИнструментов.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПанельИнструментов.Добавить("Нажатие");
		МассивСвойствПанельИнструментов.Добавить("Отображать");
		МассивСвойствПанельИнструментов.Добавить("Оформление");
		МассивСвойствПанельИнструментов.Добавить("Переносить");
		МассивСвойствПанельИнструментов.Добавить("ПоказатьПодсказку");
		МассивСвойствПанельИнструментов.Добавить("Положение");
		МассивСвойствПанельИнструментов.Добавить("ПоложениеИзменено");
		МассивСвойствПанельИнструментов.Добавить("ПорядокОбхода");
		МассивСвойствПанельИнструментов.Добавить("ПриВходе");
		МассивСвойствПанельИнструментов.Добавить("ПриЗадержкеМыши");
		МассивСвойствПанельИнструментов.Добавить("ПриНажатииКнопки");
		МассивСвойствПанельИнструментов.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПанельИнструментов.Добавить("ПриОтпусканииМыши");
		МассивСвойствПанельИнструментов.Добавить("ПриПеремещении");
		МассивСвойствПанельИнструментов.Добавить("ПриПеремещенииМыши");
		МассивСвойствПанельИнструментов.Добавить("ПриПерерисовке");
		МассивСвойствПанельИнструментов.Добавить("ПриПотереФокуса");
		МассивСвойствПанельИнструментов.Добавить("ПриУходе");
		МассивСвойствПанельИнструментов.Добавить("Разделитель");
		МассивСвойствПанельИнструментов.Добавить("Размер");
		МассивСвойствПанельИнструментов.Добавить("РазмерИзменен");
		МассивСвойствПанельИнструментов.Добавить("РазмерКнопки");
		МассивСвойствПанельИнструментов.Добавить("СписокИзображений");
		МассивСвойствПанельИнструментов.Добавить("СтильГраницы");
		МассивСвойствПанельИнструментов.Добавить("Стрелки");
		МассивСвойствПанельИнструментов.Добавить("Стыковка");
		МассивСвойствПанельИнструментов.Добавить("ТабФокус");
		МассивСвойствПанельИнструментов.Добавить("ТекстИзменен");
		МассивСвойствПанельИнструментов.Добавить("Шрифт");
		МассивСвойствПанельИнструментов.Добавить("ЭлементДобавлен");
		МассивСвойствПанельИнструментов.Добавить("ЭлементУдален");
		МассивСвойствПанельИнструментов.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствПереключатель = Новый СписокЗначений();
		МассивСвойствПереключатель.Добавить("ToolTip на Подсказка");
		МассивСвойствПереключатель.Добавить("АвтоПометка");
		МассивСвойствПереключатель.Добавить("ВыравниваниеИзображения");
		МассивСвойствПереключатель.Добавить("ВыравниваниеПометки");
		МассивСвойствПереключатель.Добавить("ВыравниваниеТекста");
		МассивСвойствПереключатель.Добавить("ДвойноеНажатие");
		МассивСвойствПереключатель.Добавить("Доступность");
		МассивСвойствПереключатель.Добавить("Изображение");
		МассивСвойствПереключатель.Добавить("ИндексИзображения");
		МассивСвойствПереключатель.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПереключатель.Добавить("КлавишаВверх");
		МассивСвойствПереключатель.Добавить("КлавишаВниз");
		МассивСвойствПереключатель.Добавить("КлавишаНажата");
		МассивСвойствПереключатель.Добавить("Курсор");
		МассивСвойствПереключатель.Добавить("МышьНадЭлементом");
		МассивСвойствПереключатель.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПереключатель.Добавить("Нажатие");
		МассивСвойствПереключатель.Добавить("ОсновнойЦвет");
		МассивСвойствПереключатель.Добавить("Отображать");
		МассивСвойствПереключатель.Добавить("Оформление");
		МассивСвойствПереключатель.Добавить("ПлоскийСтиль");
		МассивСвойствПереключатель.Добавить("Положение");
		МассивСвойствПереключатель.Добавить("ПоложениеИзменено");
		МассивСвойствПереключатель.Добавить("ПометкаИзменена");
		МассивСвойствПереключатель.Добавить("Помечен");
		МассивСвойствПереключатель.Добавить("ПорядокОбхода");
		МассивСвойствПереключатель.Добавить("ПриВходе");
		МассивСвойствПереключатель.Добавить("ПриЗадержкеМыши");
		МассивСвойствПереключатель.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПереключатель.Добавить("ПриОтпусканииМыши");
		МассивСвойствПереключатель.Добавить("ПриПеремещении");
		МассивСвойствПереключатель.Добавить("ПриПеремещенииМыши");
		МассивСвойствПереключатель.Добавить("ПриПерерисовке");
		МассивСвойствПереключатель.Добавить("ПриПотереФокуса");
		МассивСвойствПереключатель.Добавить("ПриУходе");
		МассивСвойствПереключатель.Добавить("Размер");
		МассивСвойствПереключатель.Добавить("РазмерИзменен");
		МассивСвойствПереключатель.Добавить("СписокИзображений");
		МассивСвойствПереключатель.Добавить("Стыковка");
		МассивСвойствПереключатель.Добавить("ТабФокус");
		МассивСвойствПереключатель.Добавить("Текст");
		МассивСвойствПереключатель.Добавить("ТекстИзменен");
		МассивСвойствПереключатель.Добавить("ФоновоеИзображение");
		МассивСвойствПереключатель.Добавить("ЦветФона");
		МассивСвойствПереключатель.Добавить("Шрифт");
		МассивСвойствПереключатель.Добавить("ЭлементДобавлен");
		МассивСвойствПереключатель.Добавить("ЭлементУдален");
		МассивСвойствПереключатель.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствПодсказка = Новый СписокЗначений();
		МассивСвойствПодсказка.Добавить("АвтоЗадержка");
		МассивСвойствПодсказка.Добавить("АвтоЗадержкаПоказа");
		МассивСвойствПодсказка.Добавить("Активна");
		МассивСвойствПодсказка.Добавить("ЗадержкаОчередногоПоказа");
		МассивСвойствПодсказка.Добавить("ЗадержкаПоявления");
		МассивСвойствПодсказка.Добавить("ПоказыватьВсегда");
//=============================================================================================================
	МассивСвойствПолеВвода = Новый СписокЗначений();
		МассивСвойствПолеВвода.Добавить("ToolTip на Подсказка");
		МассивСвойствПолеВвода.Добавить("ДвойноеНажатие");
		МассивСвойствПолеВвода.Добавить("Доступность");
		МассивСвойствПолеВвода.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПолеВвода.Добавить("КлавишаВверх");
		МассивСвойствПолеВвода.Добавить("КлавишаВниз");
		МассивСвойствПолеВвода.Добавить("КлавишаНажата");
		МассивСвойствПолеВвода.Добавить("Курсор");
		МассивСвойствПолеВвода.Добавить("МаксимальнаяДлина");
		МассивСвойствПолеВвода.Добавить("МногострочныйРежим");
		МассивСвойствПолеВвода.Добавить("МышьНадЭлементом");
		МассивСвойствПолеВвода.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПолеВвода.Добавить("Нажатие");
		МассивСвойствПолеВвода.Добавить("ОсновнойЦвет");
		МассивСвойствПолеВвода.Добавить("Отображать");
		МассивСвойствПолеВвода.Добавить("Перенос");
		МассивСвойствПолеВвода.Добавить("Положение");
		МассивСвойствПолеВвода.Добавить("ПоложениеИзменено");
		МассивСвойствПолеВвода.Добавить("ПолосыПрокрутки");
		МассивСвойствПолеВвода.Добавить("ПорядокОбхода");
		МассивСвойствПолеВвода.Добавить("ПриВходе");
		МассивСвойствПолеВвода.Добавить("ПриЗадержкеМыши");
		МассивСвойствПолеВвода.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПолеВвода.Добавить("ПриОтпусканииМыши");
		МассивСвойствПолеВвода.Добавить("ПриПеремещении");
		МассивСвойствПолеВвода.Добавить("ПриПеремещенииМыши");
		МассивСвойствПолеВвода.Добавить("ПриПерерисовке");
		МассивСвойствПолеВвода.Добавить("ПриПотереФокуса");
		МассивСвойствПолеВвода.Добавить("ПриУходе");
		МассивСвойствПолеВвода.Добавить("ПринятиеВозврат");
		МассивСвойствПолеВвода.Добавить("ПринятиеТаб");
		МассивСвойствПолеВвода.Добавить("Размер");
		МассивСвойствПолеВвода.Добавить("РазмерИзменен");
		МассивСвойствПолеВвода.Добавить("РегистрСимволов");
		МассивСвойствПолеВвода.Добавить("СимволПароля");
		МассивСвойствПолеВвода.Добавить("СкрытьВыделение");
		МассивСвойствПолеВвода.Добавить("СтильГраницы");
		МассивСвойствПолеВвода.Добавить("Стыковка");
		МассивСвойствПолеВвода.Добавить("ТабФокус");
		МассивСвойствПолеВвода.Добавить("Текст");
		МассивСвойствПолеВвода.Добавить("ТекстИзменен");
		МассивСвойствПолеВвода.Добавить("ТолькоЧтение");
		МассивСвойствПолеВвода.Добавить("ЦветФона");
		МассивСвойствПолеВвода.Добавить("Шрифт");
		МассивСвойствПолеВвода.Добавить("ЭлементДобавлен");
		МассивСвойствПолеВвода.Добавить("ЭлементУдален");
		МассивСвойствПолеВвода.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствПолеВыбора = Новый СписокЗначений();
		МассивСвойствПолеВыбора.Добавить("ToolTip на Подсказка");
		МассивСвойствПолеВыбора.Добавить("ВысотаЭлемента");
		МассивСвойствПолеВыбора.Добавить("ДвойноеНажатие");
		МассивСвойствПолеВыбора.Добавить("Доступность");
		МассивСвойствПолеВыбора.Добавить("ИндексВыбранногоИзменен");
		МассивСвойствПолеВыбора.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПолеВыбора.Добавить("КлавишаВверх");
		МассивСвойствПолеВыбора.Добавить("КлавишаВниз");
		МассивСвойствПолеВыбора.Добавить("КлавишаНажата");
		МассивСвойствПолеВыбора.Добавить("Курсор");
		МассивСвойствПолеВыбора.Добавить("МаксимальнаяДлина");
		МассивСвойствПолеВыбора.Добавить("МаксимумЭлементов");
		МассивСвойствПолеВыбора.Добавить("МышьНадЭлементом");
		МассивСвойствПолеВыбора.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПолеВыбора.Добавить("Нажатие");
		МассивСвойствПолеВыбора.Добавить("ОсновнойЦвет");
		МассивСвойствПолеВыбора.Добавить("Отображать");
		МассивСвойствПолеВыбора.Добавить("Отсортирован");
		МассивСвойствПолеВыбора.Добавить("ПодборВысоты");
		МассивСвойствПолеВыбора.Добавить("Положение");
		МассивСвойствПолеВыбора.Добавить("ПоложениеИзменено");
		МассивСвойствПолеВыбора.Добавить("ПорядокОбхода");
		МассивСвойствПолеВыбора.Добавить("ПриВходе");
		МассивСвойствПолеВыбора.Добавить("ПриВыпадении");
		МассивСвойствПолеВыбора.Добавить("ПриЗадержкеМыши");
		МассивСвойствПолеВыбора.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПолеВыбора.Добавить("ПриОтпусканииМыши");
		МассивСвойствПолеВыбора.Добавить("ПриПеремещении");
		МассивСвойствПолеВыбора.Добавить("ПриПеремещенииМыши");
		МассивСвойствПолеВыбора.Добавить("ПриПерерисовке");
		МассивСвойствПолеВыбора.Добавить("ПриПотереФокуса");
		МассивСвойствПолеВыбора.Добавить("ПриУходе");
		МассивСвойствПолеВыбора.Добавить("Размер");
		МассивСвойствПолеВыбора.Добавить("РазмерИзменен");
		МассивСвойствПолеВыбора.Добавить("РежимРисования");
		МассивСвойствПолеВыбора.Добавить("СтильВыпадающегоСписка");
		МассивСвойствПолеВыбора.Добавить("Стыковка");
		МассивСвойствПолеВыбора.Добавить("ТабФокус");
		МассивСвойствПолеВыбора.Добавить("Текст");
		МассивСвойствПолеВыбора.Добавить("ТекстИзменен");
		МассивСвойствПолеВыбора.Добавить("ЦветФона");
		МассивСвойствПолеВыбора.Добавить("ШиринаВыпадающегоСписка");
		МассивСвойствПолеВыбора.Добавить("Шрифт");
		МассивСвойствПолеВыбора.Добавить("ЭлементДобавлен");
		МассивСвойствПолеВыбора.Добавить("ЭлементУдален");
		МассивСвойствПолеВыбора.Добавить("Элементы");
		МассивСвойствПолеВыбора.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствПолеКалендаря = Новый СписокЗначений();
		МассивСвойствПолеКалендаря.Добавить("ToolTip на Подсказка");
		МассивСвойствПолеКалендаря.Добавить("ВыравниваниеПриРаскрытии");
		МассивСвойствПолеКалендаря.Добавить("ДвойноеНажатие");
		МассивСвойствПолеКалендаря.Добавить("Доступность");
		МассивСвойствПолеКалендаря.Добавить("Значение");
		МассивСвойствПолеКалендаря.Добавить("ЗначениеИзменено");
		МассивСвойствПолеКалендаря.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПолеКалендаря.Добавить("КлавишаВверх");
		МассивСвойствПолеКалендаря.Добавить("КлавишаВниз");
		МассивСвойствПолеКалендаря.Добавить("КлавишаНажата");
		МассивСвойствПолеКалендаря.Добавить("Курсор");
		МассивСвойствПолеКалендаря.Добавить("МаксимальнаяДата");
		МассивСвойствПолеКалендаря.Добавить("МинимальнаяДата");
		МассивСвойствПолеКалендаря.Добавить("МышьНадЭлементом");
		МассивСвойствПолеКалендаря.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПолеКалендаря.Добавить("Нажатие");
		МассивСвойствПолеКалендаря.Добавить("Отображать");
		МассивСвойствПолеКалендаря.Добавить("ПоказатьРегулятор");
		МассивСвойствПолеКалендаря.Добавить("ПоказатьФлажок");
		МассивСвойствПолеКалендаря.Добавить("Положение");
		МассивСвойствПолеКалендаря.Добавить("ПоложениеИзменено");
		МассивСвойствПолеКалендаря.Добавить("ПользовательскийФормат");
		МассивСвойствПолеКалендаря.Добавить("ПорядокОбхода");
		МассивСвойствПолеКалендаря.Добавить("ПриВходе");
		МассивСвойствПолеКалендаря.Добавить("ПриЗадержкеМыши");
		МассивСвойствПолеКалендаря.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПолеКалендаря.Добавить("ПриОтпусканииМыши");
		МассивСвойствПолеКалендаря.Добавить("ПриПеремещении");
		МассивСвойствПолеКалендаря.Добавить("ПриПеремещенииМыши");
		МассивСвойствПолеКалендаря.Добавить("ПриПерерисовке");
		МассивСвойствПолеКалендаря.Добавить("ПриПотереФокуса");
		МассивСвойствПолеКалендаря.Добавить("ПриУходе");
		МассивСвойствПолеКалендаря.Добавить("Размер");
		МассивСвойствПолеКалендаря.Добавить("РазмерИзменен");
		МассивСвойствПолеКалендаря.Добавить("Стыковка");
		МассивСвойствПолеКалендаря.Добавить("ТабФокус");
		МассивСвойствПолеКалендаря.Добавить("ТекстИзменен");
		МассивСвойствПолеКалендаря.Добавить("Формат");
		МассивСвойствПолеКалендаря.Добавить("Шрифт");
		МассивСвойствПолеКалендаря.Добавить("ЭлементДобавлен");
		МассивСвойствПолеКалендаря.Добавить("ЭлементУдален");
		МассивСвойствПолеКалендаря.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствПолеКартинки = Новый СписокЗначений();
		МассивСвойствПолеКартинки.Добавить("ToolTip на Подсказка");
		МассивСвойствПолеКартинки.Добавить("ДвойноеНажатие");
		МассивСвойствПолеКартинки.Добавить("Доступность");
		МассивСвойствПолеКартинки.Добавить("Изображение");
		МассивСвойствПолеКартинки.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПолеКартинки.Добавить("КлавишаВверх");
		МассивСвойствПолеКартинки.Добавить("КлавишаВниз");
		МассивСвойствПолеКартинки.Добавить("КлавишаНажата");
		МассивСвойствПолеКартинки.Добавить("Курсор");
		МассивСвойствПолеКартинки.Добавить("МышьНадЭлементом");
		МассивСвойствПолеКартинки.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПолеКартинки.Добавить("Нажатие");
		МассивСвойствПолеКартинки.Добавить("Отображать");
		МассивСвойствПолеКартинки.Добавить("Положение");
		МассивСвойствПолеКартинки.Добавить("ПоложениеИзменено");
		МассивСвойствПолеКартинки.Добавить("ПриВходе");
		МассивСвойствПолеКартинки.Добавить("ПриЗадержкеМыши");
		МассивСвойствПолеКартинки.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПолеКартинки.Добавить("ПриОтпусканииМыши");
		МассивСвойствПолеКартинки.Добавить("ПриПеремещении");
		МассивСвойствПолеКартинки.Добавить("ПриПеремещенииМыши");
		МассивСвойствПолеКартинки.Добавить("ПриПерерисовке");
		МассивСвойствПолеКартинки.Добавить("ПриПотереФокуса");
		МассивСвойствПолеКартинки.Добавить("ПриУходе");
		МассивСвойствПолеКартинки.Добавить("Размер");
		МассивСвойствПолеКартинки.Добавить("РазмерИзменен");
		МассивСвойствПолеКартинки.Добавить("РазмещениеФоновогоИзображения");
		МассивСвойствПолеКартинки.Добавить("РежимМасштабирования");
		МассивСвойствПолеКартинки.Добавить("СтильГраницы");
		МассивСвойствПолеКартинки.Добавить("Стыковка");
		МассивСвойствПолеКартинки.Добавить("ТекстИзменен");
		МассивСвойствПолеКартинки.Добавить("ФоновоеИзображение");
		МассивСвойствПолеКартинки.Добавить("ЦветФона");
		МассивСвойствПолеКартинки.Добавить("ЭлементДобавлен");
		МассивСвойствПолеКартинки.Добавить("ЭлементУдален");
		МассивСвойствПолеКартинки.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствПолеСписка = Новый СписокЗначений();
		МассивСвойствПолеСписка.Добавить("ToolTip на Подсказка");
		МассивСвойствПолеСписка.Добавить("ВысотаЭлемента");
		МассивСвойствПолеСписка.Добавить("ГоризонтальнаяМера");
		МассивСвойствПолеСписка.Добавить("ГоризонтальнаяПрокрутка");
		МассивСвойствПолеСписка.Добавить("ДвойноеНажатие");
		МассивСвойствПолеСписка.Добавить("Доступность");
		МассивСвойствПолеСписка.Добавить("ИндексВыбранногоИзменен");
		МассивСвойствПолеСписка.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПолеСписка.Добавить("ИспользоватьТабулятор");
		МассивСвойствПолеСписка.Добавить("КлавишаВверх");
		МассивСвойствПолеСписка.Добавить("КлавишаВниз");
		МассивСвойствПолеСписка.Добавить("КлавишаНажата");
		МассивСвойствПолеСписка.Добавить("Курсор");
		МассивСвойствПолеСписка.Добавить("Многоколоночное");
		МассивСвойствПолеСписка.Добавить("МышьНадЭлементом");
		МассивСвойствПолеСписка.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПолеСписка.Добавить("Нажатие");
		МассивСвойствПолеСписка.Добавить("ОсновнойЦвет");
		МассивСвойствПолеСписка.Добавить("Отображать");
		МассивСвойствПолеСписка.Добавить("Отсортирован");
		МассивСвойствПолеСписка.Добавить("ПодборВысоты");
		МассивСвойствПолеСписка.Добавить("Положение");
		МассивСвойствПолеСписка.Добавить("ПоложениеИзменено");
		МассивСвойствПолеСписка.Добавить("ПорядокОбхода");
		МассивСвойствПолеСписка.Добавить("ПриВходе");
		МассивСвойствПолеСписка.Добавить("ПриЗадержкеМыши");
		МассивСвойствПолеСписка.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПолеСписка.Добавить("ПриОтпусканииМыши");
		МассивСвойствПолеСписка.Добавить("ПриПеремещении");
		МассивСвойствПолеСписка.Добавить("ПриПеремещенииМыши");
		МассивСвойствПолеСписка.Добавить("ПриПерерисовке");
		МассивСвойствПолеСписка.Добавить("ПриПотереФокуса");
		МассивСвойствПолеСписка.Добавить("ПриУходе");
		МассивСвойствПолеСписка.Добавить("ПрокруткаВсегдаОтображается");
		МассивСвойствПолеСписка.Добавить("Размер");
		МассивСвойствПолеСписка.Добавить("РазмерИзменен");
		МассивСвойствПолеСписка.Добавить("РежимВыбора");
		МассивСвойствПолеСписка.Добавить("СтильГраницы");
		МассивСвойствПолеСписка.Добавить("Стыковка");
		МассивСвойствПолеСписка.Добавить("ТабФокус");
		МассивСвойствПолеСписка.Добавить("ТекстИзменен");
		МассивСвойствПолеСписка.Добавить("ЦветФона");
		МассивСвойствПолеСписка.Добавить("ШиринаКолонки");
		МассивСвойствПолеСписка.Добавить("Шрифт");
		МассивСвойствПолеСписка.Добавить("ЭлементДобавлен");
		МассивСвойствПолеСписка.Добавить("ЭлементУдален");
		МассивСвойствПолеСписка.Добавить("Элементы");
		МассивСвойствПолеСписка.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствПользовательскийЭлементУправления = Новый СписокЗначений();
		МассивСвойствПользовательскийЭлементУправления.Добавить("ToolTip на Подсказка");
		МассивСвойствПользовательскийЭлементУправления.Добавить("АвтоПрокрутка");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ДвойноеНажатие");
		МассивСвойствПользовательскийЭлементУправления.Добавить("Доступность");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствПользовательскийЭлементУправления.Добавить("КлавишаВверх");
		МассивСвойствПользовательскийЭлементУправления.Добавить("КлавишаВниз");
		МассивСвойствПользовательскийЭлементУправления.Добавить("КлавишаНажата");
		МассивСвойствПользовательскийЭлементУправления.Добавить("Курсор");
		МассивСвойствПользовательскийЭлементУправления.Добавить("МышьНадЭлементом");
		МассивСвойствПользовательскийЭлементУправления.Добавить("МышьПокинулаЭлемент");
		МассивСвойствПользовательскийЭлементУправления.Добавить("Нажатие");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ОсновнойЦвет");
		МассивСвойствПользовательскийЭлементУправления.Добавить("Отображать");
		МассивСвойствПользовательскийЭлементУправления.Добавить("Положение");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПоложениеИзменено");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПорядокОбхода");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПриВходе");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПриЗадержкеМыши");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПриОтпусканииМыши");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПриПеремещении");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПриПеремещенииМыши");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПриПерерисовке");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПриПотереФокуса");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ПриУходе");
		МассивСвойствПользовательскийЭлементУправления.Добавить("Размер");
		МассивСвойствПользовательскийЭлементУправления.Добавить("РазмерИзменен");
		МассивСвойствПользовательскийЭлементУправления.Добавить("РазмерПоляАвтоПрокрутки");
		МассивСвойствПользовательскийЭлементУправления.Добавить("Стыковка");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ТабФокус");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ТекстИзменен");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ФоновоеИзображение");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ЦветФона");
		МассивСвойствПользовательскийЭлементУправления.Добавить("Шрифт");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ЭлементДобавлен");
		МассивСвойствПользовательскийЭлементУправления.Добавить("ЭлементУдален");
		МассивСвойствПользовательскийЭлементУправления.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствРазделитель = Новый СписокЗначений();
		МассивСвойствРазделитель.Добавить("ToolTip на Подсказка");
		МассивСвойствРазделитель.Добавить("ДвойноеНажатие");
		МассивСвойствРазделитель.Добавить("Доступность");
		МассивСвойствРазделитель.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствРазделитель.Добавить("КлавишаВверх");
		МассивСвойствРазделитель.Добавить("КлавишаВниз");
		МассивСвойствРазделитель.Добавить("КлавишаНажата");
		МассивСвойствРазделитель.Добавить("Курсор");
		МассивСвойствРазделитель.Добавить("МинимальноеРасстояние");
		МассивСвойствРазделитель.Добавить("МинимальныйРазмер");
		МассивСвойствРазделитель.Добавить("МышьНадЭлементом");
		МассивСвойствРазделитель.Добавить("МышьПокинулаЭлемент");
		МассивСвойствРазделитель.Добавить("Нажатие");
		МассивСвойствРазделитель.Добавить("Отображать");
		МассивСвойствРазделитель.Добавить("ПоложениеИзменено");
		МассивСвойствРазделитель.Добавить("ПорядокОбхода");
		МассивСвойствРазделитель.Добавить("ПриВходе");
		МассивСвойствРазделитель.Добавить("ПриЗадержкеМыши");
		МассивСвойствРазделитель.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствРазделитель.Добавить("ПриОтпусканииМыши");
		МассивСвойствРазделитель.Добавить("ПриПеремещении");
		МассивСвойствРазделитель.Добавить("ПриПеремещенииМыши");
		МассивСвойствРазделитель.Добавить("ПриПерерисовке");
		МассивСвойствРазделитель.Добавить("ПриПотереФокуса");
		МассивСвойствРазделитель.Добавить("ПриУходе");
		МассивСвойствРазделитель.Добавить("Размер");
		МассивСвойствРазделитель.Добавить("РазмерИзменен");
		МассивСвойствРазделитель.Добавить("Стыковка");
		МассивСвойствРазделитель.Добавить("ТекстИзменен");
		МассивСвойствРазделитель.Добавить("ЦветФона");
		МассивСвойствРазделитель.Добавить("ЭлементДобавлен");
		МассивСвойствРазделитель.Добавить("ЭлементУдален");
//=============================================================================================================
	МассивСвойствРамкаГруппы = Новый СписокЗначений();
		МассивСвойствРамкаГруппы.Добавить("ToolTip на Подсказка");
		МассивСвойствРамкаГруппы.Добавить("ДвойноеНажатие");
		МассивСвойствРамкаГруппы.Добавить("Доступность");
		МассивСвойствРамкаГруппы.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствРамкаГруппы.Добавить("КлавишаВверх");
		МассивСвойствРамкаГруппы.Добавить("КлавишаВниз");
		МассивСвойствРамкаГруппы.Добавить("КлавишаНажата");
		МассивСвойствРамкаГруппы.Добавить("Курсор");
		МассивСвойствРамкаГруппы.Добавить("МышьНадЭлементом");
		МассивСвойствРамкаГруппы.Добавить("МышьПокинулаЭлемент");
		МассивСвойствРамкаГруппы.Добавить("Нажатие");
		МассивСвойствРамкаГруппы.Добавить("ОсновнойЦвет");
		МассивСвойствРамкаГруппы.Добавить("Отображать");
		МассивСвойствРамкаГруппы.Добавить("Положение");
		МассивСвойствРамкаГруппы.Добавить("ПоложениеИзменено");
		МассивСвойствРамкаГруппы.Добавить("ПорядокОбхода");
		МассивСвойствРамкаГруппы.Добавить("ПриВходе");
		МассивСвойствРамкаГруппы.Добавить("ПриЗадержкеМыши");
		МассивСвойствРамкаГруппы.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствРамкаГруппы.Добавить("ПриОтпусканииМыши");
		МассивСвойствРамкаГруппы.Добавить("ПриПеремещении");
		МассивСвойствРамкаГруппы.Добавить("ПриПеремещенииМыши");
		МассивСвойствРамкаГруппы.Добавить("ПриПерерисовке");
		МассивСвойствРамкаГруппы.Добавить("ПриПотереФокуса");
		МассивСвойствРамкаГруппы.Добавить("ПриУходе");
		МассивСвойствРамкаГруппы.Добавить("Размер");
		МассивСвойствРамкаГруппы.Добавить("РазмерИзменен");
		МассивСвойствРамкаГруппы.Добавить("Стыковка");
		МассивСвойствРамкаГруппы.Добавить("Текст");
		МассивСвойствРамкаГруппы.Добавить("ТекстИзменен");
		МассивСвойствРамкаГруппы.Добавить("ФоновоеИзображение");
		МассивСвойствРамкаГруппы.Добавить("ЦветФона");
		МассивСвойствРамкаГруппы.Добавить("Шрифт");
		МассивСвойствРамкаГруппы.Добавить("ЭлементДобавлен");
		МассивСвойствРамкаГруппы.Добавить("ЭлементУдален");
		МассивСвойствРамкаГруппы.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствРегуляторВверхВниз = Новый СписокЗначений();
		МассивСвойствРегуляторВверхВниз.Добавить("ToolTip на Подсказка");
		МассивСвойствРегуляторВверхВниз.Добавить("ДвойноеНажатие");
		МассивСвойствРегуляторВверхВниз.Добавить("Доступность");
		МассивСвойствРегуляторВверхВниз.Добавить("Значение");
		МассивСвойствРегуляторВверхВниз.Добавить("ЗначениеИзменено");
		МассивСвойствРегуляторВверхВниз.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствРегуляторВверхВниз.Добавить("КлавишаВверх");
		МассивСвойствРегуляторВверхВниз.Добавить("КлавишаВниз");
		МассивСвойствРегуляторВверхВниз.Добавить("КлавишаНажата");
		МассивСвойствРегуляторВверхВниз.Добавить("Курсор");
		МассивСвойствРегуляторВверхВниз.Добавить("Максимум");
		МассивСвойствРегуляторВверхВниз.Добавить("Минимум");
		МассивСвойствРегуляторВверхВниз.Добавить("МышьНадЭлементом");
		МассивСвойствРегуляторВверхВниз.Добавить("МышьПокинулаЭлемент");
		МассивСвойствРегуляторВверхВниз.Добавить("Нажатие");
		МассивСвойствРегуляторВверхВниз.Добавить("ОсновнойЦвет");
		МассивСвойствРегуляторВверхВниз.Добавить("Отображать");
		МассивСвойствРегуляторВверхВниз.Добавить("Положение");
		МассивСвойствРегуляторВверхВниз.Добавить("ПоложениеИзменено");
		МассивСвойствРегуляторВверхВниз.Добавить("ПорядокОбхода");
		МассивСвойствРегуляторВверхВниз.Добавить("ПриВходе");
		МассивСвойствРегуляторВверхВниз.Добавить("ПриЗадержкеМыши");
		МассивСвойствРегуляторВверхВниз.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствРегуляторВверхВниз.Добавить("ПриОтпусканииМыши");
		МассивСвойствРегуляторВверхВниз.Добавить("ПриПеремещении");
		МассивСвойствРегуляторВверхВниз.Добавить("ПриПеремещенииМыши");
		МассивСвойствРегуляторВверхВниз.Добавить("ПриПерерисовке");
		МассивСвойствРегуляторВверхВниз.Добавить("ПриПотереФокуса");
		МассивСвойствРегуляторВверхВниз.Добавить("ПриУходе");
		МассивСвойствРегуляторВверхВниз.Добавить("Размер");
		МассивСвойствРегуляторВверхВниз.Добавить("РазмерИзменен");
		МассивСвойствРегуляторВверхВниз.Добавить("Разрядность");
		МассивСвойствРегуляторВверхВниз.Добавить("СтильГраницы");
		МассивСвойствРегуляторВверхВниз.Добавить("Стыковка");
		МассивСвойствРегуляторВверхВниз.Добавить("ТабФокус");
		МассивСвойствРегуляторВверхВниз.Добавить("ТекстИзменен");
		МассивСвойствРегуляторВверхВниз.Добавить("ТолькоЧтение");
		МассивСвойствРегуляторВверхВниз.Добавить("Увеличение");
		МассивСвойствРегуляторВверхВниз.Добавить("ЦветФона");
		МассивСвойствРегуляторВверхВниз.Добавить("Шрифт");
		МассивСвойствРегуляторВверхВниз.Добавить("ЭлементДобавлен");
		МассивСвойствРегуляторВверхВниз.Добавить("ЭлементУдален");
		МассивСвойствРегуляторВверхВниз.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствСеткаДанных = Новый СписокЗначений();
		МассивСвойствСеткаДанных.Добавить("ToolTip на Подсказка");
		МассивСвойствСеткаДанных.Добавить("ДвойноеНажатие");
		МассивСвойствСеткаДанных.Добавить("Доступность");
		МассивСвойствСеткаДанных.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствСеткаДанных.Добавить("КлавишаВверх");
		МассивСвойствСеткаДанных.Добавить("КлавишаВниз");
		МассивСвойствСеткаДанных.Добавить("КлавишаНажата");
		МассивСвойствСеткаДанных.Добавить("МышьНадЭлементом");
		МассивСвойствСеткаДанных.Добавить("МышьПокинулаЭлемент");
		МассивСвойствСеткаДанных.Добавить("Нажатие");
		МассивСвойствСеткаДанных.Добавить("ОсновнойЦвет");
		МассивСвойствСеткаДанных.Добавить("Отображать");
		МассивСвойствСеткаДанных.Добавить("ОтображатьЗаголовок");
		МассивСвойствСеткаДанных.Добавить("Положение");
		МассивСвойствСеткаДанных.Добавить("ПоложениеИзменено");
		МассивСвойствСеткаДанных.Добавить("ПорядокОбхода");
		МассивСвойствСеткаДанных.Добавить("ПредпочтительнаяВысотаСтрок");
		МассивСвойствСеткаДанных.Добавить("ПриВходе");
		МассивСвойствСеткаДанных.Добавить("ПриЗадержкеМыши");
		МассивСвойствСеткаДанных.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствСеткаДанных.Добавить("ПриОтпусканииМыши");
		МассивСвойствСеткаДанных.Добавить("ПриПеремещении");
		МассивСвойствСеткаДанных.Добавить("ПриПеремещенииМыши");
		МассивСвойствСеткаДанных.Добавить("ПриПерерисовке");
		МассивСвойствСеткаДанных.Добавить("ПриПотереФокуса");
		МассивСвойствСеткаДанных.Добавить("ПриУходе");
		МассивСвойствСеткаДанных.Добавить("Размер");
		МассивСвойствСеткаДанных.Добавить("РазмерИзменен");
		МассивСвойствСеткаДанных.Добавить("РазрешитьСортировку");
		МассивСвойствСеткаДанных.Добавить("СтилиТаблицы");
		МассивСвойствСеткаДанных.Добавить("Стыковка");
		МассивСвойствСеткаДанных.Добавить("ТабФокус");
		МассивСвойствСеткаДанных.Добавить("ТекстЗаголовка");
		МассивСвойствСеткаДанных.Добавить("ТекстИзменен");
		МассивСвойствСеткаДанных.Добавить("ТекущаяЯчейкаИзменена");
		МассивСвойствСеткаДанных.Добавить("ТолькоЧтение");
		МассивСвойствСеткаДанных.Добавить("ЦветФона");
		МассивСвойствСеткаДанных.Добавить("ЦветФонаЗаголовка");
		МассивСвойствСеткаДанных.Добавить("ЦветФонаСеткиДанных");
		МассивСвойствСеткаДанных.Добавить("Шрифт");
		МассивСвойствСеткаДанных.Добавить("ЭлементДобавлен");
		МассивСвойствСеткаДанных.Добавить("ЭлементУдален");
		МассивСвойствСеткаДанных.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствСеткаСвойств = Новый СписокЗначений();
		МассивСвойствСеткаСвойств.Добавить("ToolTip на Подсказка");
		МассивСвойствСеткаСвойств.Добавить("ВыбранныйОбъект");
		МассивСвойствСеткаСвойств.Добавить("ВыбранныйЭлементСеткиИзменен");
		МассивСвойствСеткаСвойств.Добавить("ДвойноеНажатие");
		МассивСвойствСеткаСвойств.Добавить("Доступность");
		МассивСвойствСеткаСвойств.Добавить("ЗначениеСвойстваИзменено");
		МассивСвойствСеткаСвойств.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствСеткаСвойств.Добавить("КлавишаВверх");
		МассивСвойствСеткаСвойств.Добавить("КлавишаВниз");
		МассивСвойствСеткаСвойств.Добавить("КлавишаНажата");
		МассивСвойствСеткаСвойств.Добавить("Курсор");
		МассивСвойствСеткаСвойств.Добавить("МышьНадЭлементом");
		МассивСвойствСеткаСвойств.Добавить("МышьПокинулаЭлемент");
		МассивСвойствСеткаСвойств.Добавить("Нажатие");
		МассивСвойствСеткаСвойств.Добавить("Отображать");
		МассивСвойствСеткаСвойств.Добавить("ОтображатьПанельИнструментов");
		МассивСвойствСеткаСвойств.Добавить("Положение");
		МассивСвойствСеткаСвойств.Добавить("ПоложениеИзменено");
		МассивСвойствСеткаСвойств.Добавить("ПорядокОбхода");
		МассивСвойствСеткаСвойств.Добавить("ПриВходе");
		МассивСвойствСеткаСвойств.Добавить("ПриЗадержкеМыши");
		МассивСвойствСеткаСвойств.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствСеткаСвойств.Добавить("ПриОтпусканииМыши");
		МассивСвойствСеткаСвойств.Добавить("ПриПеремещении");
		МассивСвойствСеткаСвойств.Добавить("ПриПеремещенииМыши");
		МассивСвойствСеткаСвойств.Добавить("ПриПерерисовке");
		МассивСвойствСеткаСвойств.Добавить("ПриПотереФокуса");
		МассивСвойствСеткаСвойств.Добавить("ПриУходе");
		МассивСвойствСеткаСвойств.Добавить("Размер");
		МассивСвойствСеткаСвойств.Добавить("РазмерИзменен");
		МассивСвойствСеткаСвойств.Добавить("СортировкаСвойств");
		МассивСвойствСеткаСвойств.Добавить("Стыковка");
		МассивСвойствСеткаСвойств.Добавить("ТабФокус");
		МассивСвойствСеткаСвойств.Добавить("ТекстИзменен");
		МассивСвойствСеткаСвойств.Добавить("ЦветФона");
		МассивСвойствСеткаСвойств.Добавить("Шрифт");
		МассивСвойствСеткаСвойств.Добавить("ЭлементДобавлен");
		МассивСвойствСеткаСвойств.Добавить("ЭлементУдален");
		МассивСвойствСеткаСвойств.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствСписокИзображений = Новый СписокЗначений();
		МассивСвойствСписокИзображений.Добавить("ГлубинаЦвета");
		МассивСвойствСписокИзображений.Добавить("Изображения");
		МассивСвойствСписокИзображений.Добавить("РазмерИзображения");
//=============================================================================================================
	МассивСвойствСписокЭлементов = Новый СписокЗначений();
		МассивСвойствСписокЭлементов.Добавить("ToolTip на Подсказка");
		МассивСвойствСписокЭлементов.Добавить("АвтоУпорядочивание");
		МассивСвойствСписокЭлементов.Добавить("Активация");
		МассивСвойствСписокЭлементов.Добавить("ВыборПриНаведении");
		МассивСвойствСписокЭлементов.Добавить("Выравнивание");
		МассивСвойствСписокЭлементов.Добавить("ДвойноеНажатие");
		МассивСвойствСписокЭлементов.Добавить("Доступность");
		МассивСвойствСписокЭлементов.Добавить("ИндексВыбранногоИзменен");
		МассивСвойствСписокЭлементов.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствСписокЭлементов.Добавить("КлавишаВверх");
		МассивСвойствСписокЭлементов.Добавить("КлавишаВниз");
		МассивСвойствСписокЭлементов.Добавить("КлавишаНажата");
		МассивСвойствСписокЭлементов.Добавить("КолонкаНажатие");
		МассивСвойствСписокЭлементов.Добавить("Колонки");
		МассивСвойствСписокЭлементов.Добавить("Курсор");
		МассивСвойствСписокЭлементов.Добавить("МножественныйВыбор");
		МассивСвойствСписокЭлементов.Добавить("МышьНадЭлементом");
		МассивСвойствСписокЭлементов.Добавить("МышьПокинулаЭлемент");
		МассивСвойствСписокЭлементов.Добавить("Нажатие");
		МассивСвойствСписокЭлементов.Добавить("ОсновнойЦвет");
		МассивСвойствСписокЭлементов.Добавить("Отображать");
		МассивСвойствСписокЭлементов.Добавить("ПередРедактированиемНадписи");
		МассивСвойствСписокЭлементов.Добавить("ПереносНадписи");
		МассивСвойствСписокЭлементов.Добавить("ПолныйВыборСтроки");
		МассивСвойствСписокЭлементов.Добавить("Положение");
		МассивСвойствСписокЭлементов.Добавить("ПоложениеИзменено");
		МассивСвойствСписокЭлементов.Добавить("ПорядокОбхода");
		МассивСвойствСписокЭлементов.Добавить("ПослеРедактированияНадписи");
		МассивСвойствСписокЭлементов.Добавить("ПриАктивизацииЭлемента");
		МассивСвойствСписокЭлементов.Добавить("ПриВходе");
		МассивСвойствСписокЭлементов.Добавить("ПриЗадержкеМыши");
		МассивСвойствСписокЭлементов.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствСписокЭлементов.Добавить("ПриОтпусканииМыши");
		МассивСвойствСписокЭлементов.Добавить("ПриПеремещении");
		МассивСвойствСписокЭлементов.Добавить("ПриПеремещенииМыши");
		МассивСвойствСписокЭлементов.Добавить("ПриПерерисовке");
		МассивСвойствСписокЭлементов.Добавить("ПриПотереФокуса");
		МассивСвойствСписокЭлементов.Добавить("ПриУходе");
		МассивСвойствСписокЭлементов.Добавить("Прокручиваемый");
		МассивСвойствСписокЭлементов.Добавить("Размер");
		МассивСвойствСписокЭлементов.Добавить("РазмерИзменен");
		МассивСвойствСписокЭлементов.Добавить("РазрешитьПеретаскиваниеКолонок");
		МассивСвойствСписокЭлементов.Добавить("РазрешитьСортировку");
		МассивСвойствСписокЭлементов.Добавить("РедактированиеНадписи");
		МассивСвойствСписокЭлементов.Добавить("РежимОтображения");
		МассивСвойствСписокЭлементов.Добавить("Сетка");
		МассивСвойствСписокЭлементов.Добавить("СкрытьВыделение");
		МассивСвойствСписокЭлементов.Добавить("Сортировка");
		МассивСвойствСписокЭлементов.Добавить("СписокБольшихИзображений");
		МассивСвойствСписокЭлементов.Добавить("СписокМаленькихИзображений");
		МассивСвойствСписокЭлементов.Добавить("СтильГраницы");
		МассивСвойствСписокЭлементов.Добавить("СтильЗаголовка");
		МассивСвойствСписокЭлементов.Добавить("Стыковка");
		МассивСвойствСписокЭлементов.Добавить("ТабФокус");
		МассивСвойствСписокЭлементов.Добавить("ТекстИзменен");
		МассивСвойствСписокЭлементов.Добавить("Флажки");
		МассивСвойствСписокЭлементов.Добавить("ФоновоеИзображение");
		МассивСвойствСписокЭлементов.Добавить("ЦветФона");
		МассивСвойствСписокЭлементов.Добавить("Шрифт");
		МассивСвойствСписокЭлементов.Добавить("ЭлементДобавлен");
		МассивСвойствСписокЭлементов.Добавить("ЭлементПомечен");
		МассивСвойствСписокЭлементов.Добавить("ЭлементУдален");
		МассивСвойствСписокЭлементов.Добавить("Элементы");
		МассивСвойствСписокЭлементов.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствСтрокаСостояния = Новый СписокЗначений();
		МассивСвойствСтрокаСостояния.Добавить("ToolTip на Подсказка");
		МассивСвойствСтрокаСостояния.Добавить("ДвойноеНажатие");
		МассивСвойствСтрокаСостояния.Добавить("Доступность");
		МассивСвойствСтрокаСостояния.Добавить("ЗахватРазмера");
		МассивСвойствСтрокаСостояния.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствСтрокаСостояния.Добавить("КлавишаВверх");
		МассивСвойствСтрокаСостояния.Добавить("КлавишаВниз");
		МассивСвойствСтрокаСостояния.Добавить("КлавишаНажата");
		МассивСвойствСтрокаСостояния.Добавить("Курсор");
		МассивСвойствСтрокаСостояния.Добавить("МышьНадЭлементом");
		МассивСвойствСтрокаСостояния.Добавить("МышьПокинулаЭлемент");
		МассивСвойствСтрокаСостояния.Добавить("Нажатие");
		МассивСвойствСтрокаСостояния.Добавить("Отображать");
		МассивСвойствСтрокаСостояния.Добавить("Панели");
		МассивСвойствСтрокаСостояния.Добавить("ПоказатьПанели");
		МассивСвойствСтрокаСостояния.Добавить("ПоложениеИзменено");
		МассивСвойствСтрокаСостояния.Добавить("ПорядокОбхода");
		МассивСвойствСтрокаСостояния.Добавить("ПриВходе");
		МассивСвойствСтрокаСостояния.Добавить("ПриЗадержкеМыши");
		МассивСвойствСтрокаСостояния.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствСтрокаСостояния.Добавить("ПриОтпусканииМыши");
		МассивСвойствСтрокаСостояния.Добавить("ПриПеремещении");
		МассивСвойствСтрокаСостояния.Добавить("ПриПеремещенииМыши");
		МассивСвойствСтрокаСостояния.Добавить("ПриПерерисовке");
		МассивСвойствСтрокаСостояния.Добавить("ПриПотереФокуса");
		МассивСвойствСтрокаСостояния.Добавить("ПриУходе");
		МассивСвойствСтрокаСостояния.Добавить("РазмерИзменен");
		МассивСвойствСтрокаСостояния.Добавить("Стыковка");
		МассивСвойствСтрокаСостояния.Добавить("ТабФокус");
		МассивСвойствСтрокаСостояния.Добавить("Текст");
		МассивСвойствСтрокаСостояния.Добавить("ТекстИзменен");
		МассивСвойствСтрокаСостояния.Добавить("Шрифт");
		МассивСвойствСтрокаСостояния.Добавить("ЭлементДобавлен");
		МассивСвойствСтрокаСостояния.Добавить("ЭлементУдален");
		МассивСвойствСтрокаСостояния.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствТаблица = Новый СписокЗначений();
		МассивСвойствТаблица.Добавить("ToolTip на Подсказка");
		МассивСвойствТаблица.Добавить("АвтоНумерацияСтрок");
		МассивСвойствТаблица.Добавить("АвтоШиринаЗаголовковСтрок");
		МассивСвойствТаблица.Добавить("ВысотаЗаголовковКолонок");
		МассивСвойствТаблица.Добавить("ДвойноеНажатие");
		МассивСвойствТаблица.Добавить("ДвойноеНажатиеЯчейки");
		МассивСвойствТаблица.Добавить("ДобавлятьСтроки");
		МассивСвойствТаблица.Добавить("Доступность");
		МассивСвойствТаблица.Добавить("ЗначениеЯчейкиИзменено");
		МассивСвойствТаблица.Добавить("ИзменятьРазмерКолонок");
		МассивСвойствТаблица.Добавить("ИзменятьРазмерСтрок");
		МассивСвойствТаблица.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствТаблица.Добавить("КлавишаВверх");
		МассивСвойствТаблица.Добавить("КлавишаВниз");
		МассивСвойствТаблица.Добавить("КлавишаНажата");
		МассивСвойствТаблица.Добавить("Колонки");
		МассивСвойствТаблица.Добавить("Курсор");
		МассивСвойствТаблица.Добавить("МышьНадЭлементом");
		МассивСвойствТаблица.Добавить("МышьНадЯчейкой");
		МассивСвойствТаблица.Добавить("МышьПокинулаЭлемент");
		МассивСвойствТаблица.Добавить("МышьПокинулаЯчейку");
		МассивСвойствТаблица.Добавить("Нажатие");
		МассивСвойствТаблица.Добавить("НажатиеСодержимогоЯчейки");
		МассивСвойствТаблица.Добавить("НажатиеЯчейки");
		МассивСвойствТаблица.Добавить("Отображать");
		МассивСвойствТаблица.Добавить("ОтображатьЗаголовкиСтолбцов");
		МассивСвойствТаблица.Добавить("ОтображатьЗаголовкиСтрок");
		МассивСвойствТаблица.Добавить("Положение");
		МассивСвойствТаблица.Добавить("ПоложениеИзменено");
		МассивСвойствТаблица.Добавить("ПолосыПрокрутки");
		МассивСвойствТаблица.Добавить("ПорядокОбхода");
		МассивСвойствТаблица.Добавить("ПриВходе");
		МассивСвойствТаблица.Добавить("ПриВходеВСтроку");
		МассивСвойствТаблица.Добавить("ПриВходеВЯчейку");
		МассивСвойствТаблица.Добавить("ПриЗадержкеМыши");
		МассивСвойствТаблица.Добавить("ПриНажатииЗаголовкаКолонки");
		МассивСвойствТаблица.Добавить("ПриНажатииЗаголовкаСтроки");
		МассивСвойствТаблица.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствТаблица.Добавить("ПриНажатииКнопкиМышиВЯчейке");
		МассивСвойствТаблица.Добавить("ПриОтпусканииМыши");
		МассивСвойствТаблица.Добавить("ПриОтпусканииМышиНадЯчейкой");
		МассивСвойствТаблица.Добавить("ПриПеремещении");
		МассивСвойствТаблица.Добавить("ПриПеремещенииМыши");
		МассивСвойствТаблица.Добавить("ПриПеремещенииМышиНадЯчейкой");
		МассивСвойствТаблица.Добавить("ПриПерерисовке");
		МассивСвойствТаблица.Добавить("ПриПотереФокуса");
		МассивСвойствТаблица.Добавить("ПриУходе");
		МассивСвойствТаблица.Добавить("ПриУходеИзСтроки");
		МассивСвойствТаблица.Добавить("ПриУходеИзЯчейки");
		МассивСвойствТаблица.Добавить("Размер");
		МассивСвойствТаблица.Добавить("РазмерИзменен");
		МассивСвойствТаблица.Добавить("РедактированиеЯчейкиЗавершено");
		МассивСвойствТаблица.Добавить("РедактированиеЯчейкиНачато");
		МассивСвойствТаблица.Добавить("РежимАвтоРазмераКолонок");
		МассивСвойствТаблица.Добавить("РежимАвтоРазмераСтрок");
		МассивСвойствТаблица.Добавить("РежимВыбора");
		МассивСвойствТаблица.Добавить("РежимВысотыЗаголовковКолонок");
		МассивСвойствТаблица.Добавить("СтильЗаголовковКолонок");
		МассивСвойствТаблица.Добавить("СтильЗаголовковСтрок");
		МассивСвойствТаблица.Добавить("СтрелкаЗаголовковСтрок");
		МассивСвойствТаблица.Добавить("Стыковка");
		МассивСвойствТаблица.Добавить("ТабФокус");
		МассивСвойствТаблица.Добавить("ТекстИзменен");
		МассивСвойствТаблица.Добавить("ТекущаяЯчейкаИзменена");
		МассивСвойствТаблица.Добавить("ТолькоЧтение");
		МассивСвойствТаблица.Добавить("ЦветФонаТаблицы");
		МассивСвойствТаблица.Добавить("ШиринаЗаголовковСтрок");
		МассивСвойствТаблица.Добавить("Шрифт");
		МассивСвойствТаблица.Добавить("ЭлементДобавлен");
		МассивСвойствТаблица.Добавить("ЭлементУдален");
		МассивСвойствТаблица.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствТаймер = Новый СписокЗначений();
		МассивСвойствТаймер.Добавить("Интервал");
		МассивСвойствТаймер.Добавить("ПриСрабатыванииТаймера");
//=============================================================================================================
	МассивСвойствФлажок = Новый СписокЗначений();
		МассивСвойствФлажок.Добавить("ToolTip на Подсказка");
		МассивСвойствФлажок.Добавить("АвтоПометка");
		МассивСвойствФлажок.Добавить("ВыравниваниеИзображения");
		МассивСвойствФлажок.Добавить("ВыравниваниеПометки");
		МассивСвойствФлажок.Добавить("ВыравниваниеТекста");
		МассивСвойствФлажок.Добавить("ДвойноеНажатие");
		МассивСвойствФлажок.Добавить("Доступность");
		МассивСвойствФлажок.Добавить("Изображение");
		МассивСвойствФлажок.Добавить("ИндексИзображения");
		МассивСвойствФлажок.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствФлажок.Добавить("КлавишаВверх");
		МассивСвойствФлажок.Добавить("КлавишаВниз");
		МассивСвойствФлажок.Добавить("КлавишаНажата");
		МассивСвойствФлажок.Добавить("Курсор");
		МассивСвойствФлажок.Добавить("МышьНадЭлементом");
		МассивСвойствФлажок.Добавить("МышьПокинулаЭлемент");
		МассивСвойствФлажок.Добавить("Нажатие");
		МассивСвойствФлажок.Добавить("ОсновнойЦвет");
		МассивСвойствФлажок.Добавить("Отображать");
		МассивСвойствФлажок.Добавить("Оформление");
		МассивСвойствФлажок.Добавить("ПлоскийСтиль");
		МассивСвойствФлажок.Добавить("Положение");
		МассивСвойствФлажок.Добавить("ПоложениеИзменено");
		МассивСвойствФлажок.Добавить("ПометкаИзменена");
		МассивСвойствФлажок.Добавить("Помечен");
		МассивСвойствФлажок.Добавить("ПорядокОбхода");
		МассивСвойствФлажок.Добавить("ПриВходе");
		МассивСвойствФлажок.Добавить("ПриЗадержкеМыши");
		МассивСвойствФлажок.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствФлажок.Добавить("ПриОтпусканииМыши");
		МассивСвойствФлажок.Добавить("ПриПеремещении");
		МассивСвойствФлажок.Добавить("ПриПеремещенииМыши");
		МассивСвойствФлажок.Добавить("ПриПерерисовке");
		МассивСвойствФлажок.Добавить("ПриПотереФокуса");
		МассивСвойствФлажок.Добавить("ПриУходе");
		МассивСвойствФлажок.Добавить("Размер");
		МассивСвойствФлажок.Добавить("РазмерИзменен");
		МассивСвойствФлажок.Добавить("СостояниеФлажка");
		МассивСвойствФлажок.Добавить("СписокИзображений");
		МассивСвойствФлажок.Добавить("Стыковка");
		МассивСвойствФлажок.Добавить("ТабФокус");
		МассивСвойствФлажок.Добавить("Текст");
		МассивСвойствФлажок.Добавить("ТекстИзменен");
		МассивСвойствФлажок.Добавить("ФоновоеИзображение");
		МассивСвойствФлажок.Добавить("ЦветФона");
		МассивСвойствФлажок.Добавить("Шрифт");
		МассивСвойствФлажок.Добавить("ЭлементДобавлен");
		МассивСвойствФлажок.Добавить("ЭлементУдален");
		МассивСвойствФлажок.Добавить("Якорь");
//=============================================================================================================
	МассивСвойствФорматированноеПолеВвода = Новый СписокЗначений();
		МассивСвойствФорматированноеПолеВвода.Добавить("ToolTip на Подсказка");
		МассивСвойствФорматированноеПолеВвода.Добавить("АвтоВыборСлов");
		МассивСвойствФорматированноеПолеВвода.Добавить("ВыделениеИзменено");
		МассивСвойствФорматированноеПолеВвода.Добавить("ДвойноеНажатие");
		МассивСвойствФорматированноеПолеВвода.Добавить("Доступность");
		МассивСвойствФорматированноеПолеВвода.Добавить("ИспользоватьКурсорОжидания");
		МассивСвойствФорматированноеПолеВвода.Добавить("КлавишаВверх");
		МассивСвойствФорматированноеПолеВвода.Добавить("КлавишаВниз");
		МассивСвойствФорматированноеПолеВвода.Добавить("КлавишаНажата");
		МассивСвойствФорматированноеПолеВвода.Добавить("Курсор");
		МассивСвойствФорматированноеПолеВвода.Добавить("МаксимальнаяДлина");
		МассивСвойствФорматированноеПолеВвода.Добавить("Масштаб");
		МассивСвойствФорматированноеПолеВвода.Добавить("МногострочныйРежим");
		МассивСвойствФорматированноеПолеВвода.Добавить("МышьНадЭлементом");
		МассивСвойствФорматированноеПолеВвода.Добавить("МышьПокинулаЭлемент");
		МассивСвойствФорматированноеПолеВвода.Добавить("Нажатие");
		МассивСвойствФорматированноеПолеВвода.Добавить("ОбнаруживатьАдреса");
		МассивСвойствФорматированноеПолеВвода.Добавить("ОсновнойЦвет");
		МассивСвойствФорматированноеПолеВвода.Добавить("Отображать");
		МассивСвойствФорматированноеПолеВвода.Добавить("ОтступМаркера");
		МассивСвойствФорматированноеПолеВвода.Добавить("Перенос");
		МассивСвойствФорматированноеПолеВвода.Добавить("Положение");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПоложениеИзменено");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПолосыПрокрутки");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПорядокОбхода");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПравоеОграничение");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПриВходе");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПриЗадержкеМыши");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПриНажатииКнопкиМыши");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПриОтпусканииМыши");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПриПеремещении");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПриПеремещенииМыши");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПриПерерисовке");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПриПотереФокуса");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПриУходе");
		МассивСвойствФорматированноеПолеВвода.Добавить("ПринятиеТаб");
		МассивСвойствФорматированноеПолеВвода.Добавить("Размер");
		МассивСвойствФорматированноеПолеВвода.Добавить("РазмерИзменен");
		МассивСвойствФорматированноеПолеВвода.Добавить("СкрытьВыделение");
		МассивСвойствФорматированноеПолеВвода.Добавить("СсылкаНажата");
		МассивСвойствФорматированноеПолеВвода.Добавить("СтильГраницы");
		МассивСвойствФорматированноеПолеВвода.Добавить("Стыковка");
		МассивСвойствФорматированноеПолеВвода.Добавить("ТабФокус");
		МассивСвойствФорматированноеПолеВвода.Добавить("Текст");
		МассивСвойствФорматированноеПолеВвода.Добавить("ТекстИзменен");
		МассивСвойствФорматированноеПолеВвода.Добавить("ТолькоЧтение");
		МассивСвойствФорматированноеПолеВвода.Добавить("ЦветФона");
		МассивСвойствФорматированноеПолеВвода.Добавить("Шрифт");
		МассивСвойствФорматированноеПолеВвода.Добавить("ЭлементДобавлен");
		МассивСвойствФорматированноеПолеВвода.Добавить("ЭлементУдален");
		МассивСвойствФорматированноеПолеВвода.Добавить("Якорь");
//=============================================================================================================
КонецПроцедуры//СоздатьСпискиСвойств

Функция ЗаполнитьМассивСвойств(ИмяТипаКонтрола)
	Стр = "";
	Если ИмяТипаКонтрола = "ВертикальнаяПрокрутка" Тогда
		Для А = 0 По МассивСвойствВертикальнаяПрокрутка.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствВертикальнаяПрокрутка.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Вкладка" Тогда
		Для А = 0 По МассивСвойствВкладка.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствВкладка.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ГлавноеМеню" Тогда
		Для А = 0 По МассивСвойствГлавноеМеню.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствГлавноеМеню.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ГоризонтальнаяПрокрутка" Тогда
		Для А = 0 По МассивСвойствГоризонтальнаяПрокрутка.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствГоризонтальнаяПрокрутка.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Дерево" Тогда
		Для А = 0 По МассивСвойствДерево.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствДерево.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ДиалогВыбораКаталога" Тогда
		Для А = 0 По МассивСвойствДиалогВыбораКаталога.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствДиалогВыбораКаталога.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ДиалогВыбораЦвета" Тогда
		Для А = 0 По МассивСвойствДиалогВыбораЦвета.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствДиалогВыбораЦвета.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ДиалогВыбораШрифта" Тогда
		Для А = 0 По МассивСвойствДиалогВыбораШрифта.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствДиалогВыбораШрифта.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ДиалогОткрытияФайла" Тогда
		Для А = 0 По МассивСвойствДиалогОткрытияФайла.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствДиалогОткрытияФайла.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ДиалогСохраненияФайла" Тогда
		Для А = 0 По МассивСвойствДиалогСохраненияФайла.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствДиалогСохраненияФайла.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ЗначокУведомления" Тогда
		Для А = 0 По МассивСвойствЗначокУведомления.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствЗначокУведомления.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ИндикаторВертикальный" Тогда
		Для А = 0 По МассивСвойствИндикаторВертикальный.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствИндикаторВертикальный.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ИндикаторГоризонтальный" Тогда
		Для А = 0 По МассивСвойствИндикаторГоризонтальный.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствИндикаторГоризонтальный.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Календарь" Тогда
		Для А = 0 По МассивСвойствКалендарь.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствКалендарь.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Кнопка" Тогда
		Для А = 0 По МассивСвойствКнопка.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствКнопка.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "МаскаПоляВвода" Тогда
		Для А = 0 По МассивСвойствМаскаПоляВвода.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствМаскаПоляВвода.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "НаблюдательФайловойСистемы" Тогда
		Для А = 0 По МассивСвойствНаблюдательФайловойСистемы.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствНаблюдательФайловойСистемы.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Надпись" Тогда
		Для А = 0 По МассивСвойствНадпись.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствНадпись.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "НадписьСсылка" Тогда
		Для А = 0 По МассивСвойствНадписьСсылка.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствНадписьСсылка.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Панель" Тогда
		Для А = 0 По МассивСвойствПанель.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПанель.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ПанельВкладок" Тогда
		Для А = 0 По МассивСвойствПанельВкладок.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПанельВкладок.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ПанельИнструментов" Тогда
		Для А = 0 По МассивСвойствПанельИнструментов.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПанельИнструментов.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Переключатель" Тогда
		Для А = 0 По МассивСвойствПереключатель.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПереключатель.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Подсказка" Тогда
		Для А = 0 По МассивСвойствПодсказка.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПодсказка.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ПолеВвода" Тогда
		Для А = 0 По МассивСвойствПолеВвода.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПолеВвода.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ПолеВыбора" Тогда
		Для А = 0 По МассивСвойствПолеВыбора.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПолеВыбора.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ПолеКалендаря" Тогда
		Для А = 0 По МассивСвойствПолеКалендаря.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПолеКалендаря.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ПолеКартинки" Тогда
		Для А = 0 По МассивСвойствПолеКартинки.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПолеКартинки.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ПолеСписка" Тогда
		Для А = 0 По МассивСвойствПолеСписка.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПолеСписка.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ПользовательскийЭлементУправления" Тогда
		Для А = 0 По МассивСвойствПользовательскийЭлементУправления.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствПользовательскийЭлементУправления.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Разделитель" Тогда
		Для А = 0 По МассивСвойствРазделитель.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствРазделитель.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "РамкаГруппы" Тогда
		Для А = 0 По МассивСвойствРамкаГруппы.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствРамкаГруппы.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "РегуляторВверхВниз" Тогда
		Для А = 0 По МассивСвойствРегуляторВверхВниз.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствРегуляторВверхВниз.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "СеткаДанных" Тогда
		Для А = 0 По МассивСвойствСеткаДанных.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствСеткаДанных.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "СеткаСвойств" Тогда
		Для А = 0 По МассивСвойствСеткаСвойств.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствСеткаСвойств.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "СписокИзображений" Тогда
		Для А = 0 По МассивСвойствСписокИзображений.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствСписокИзображений.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "СписокЭлементов" Тогда
		Для А = 0 По МассивСвойствСписокЭлементов.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствСписокЭлементов.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "СтрокаСостояния" Тогда
		Для А = 0 По МассивСвойствСтрокаСостояния.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствСтрокаСостояния.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Таблица" Тогда
		Для А = 0 По МассивСвойствТаблица.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствТаблица.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Таймер" Тогда
		Для А = 0 По МассивСвойствТаймер.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствТаймер.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Флажок" Тогда
		Для А = 0 По МассивСвойствФлажок.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствФлажок.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "Форма" Тогда
		Для А = 0 По МассивСвойствФорма.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствФорма.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	ИначеЕсли ИмяТипаКонтрола = "ФорматированноеПолеВвода" Тогда
		Для А = 0 По МассивСвойствФорматированноеПолеВвода.Количество() - 1 Цикл	
			Стр = Стр + "МассивСвойств.Добавить(""" + МассивСвойствФорматированноеПолеВвода.Получить(А).Значение + """);"  + Символы.ПС;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СокрЛП(Стр);
КонецФункции

Функция СформироватьЗначениеСвойства(ИмяТипаКонтрола)
	Стр = "	// Для всех свойств должно быть сформировано значение соответствующего ему типа.
		|	// Получим тип значения свойства.
		|	ТипСтрокой = ДФ.ПолучитьТипСвойства(ИмяКонтрола, ИмяСвойства);
		|	ЗначениеСвойства = ДФ.ПолучитьЗначениеСвойства(ИмяКонтрола, ИмяСвойства);
		|	Сообщить(""ТипСтрокой = "" + ТипСтрокой);
		|	// ======================================================
		|	// Для событий формируем строковое значение.
		|	Если Не (М_Событий.Найти(ИмяСвойства) = Неопределено) Тогда
		|		Возврат ИмяКонтрола + ""_"" + ИмяСвойства;
		|	// ======================================================
		|	// Для булевых.
		|	ИначеЕсли ТипСтрокой = ""System.Boolean"" Тогда
		|		Возврат Не ЗначениеСвойства;
		|	// ======================================================
		|	// Для цвета обработка происходит в коде библиотеки по условию: тип - строка и имени свойства.
		|	ИначеЕсли ТипСтрокой = ""System.Drawing.Color"" Тогда
		|		Возврат ""System.Drawing.Color"";
		|	// ======================================================
		|	// Для дат.
		|	ИначеЕсли ТипСтрокой = ""System.DateTime"" Тогда
		|		Если ИмяСвойства = ""МаксимальнаяДата"" Тогда
		|			Возврат ЗначениеСвойства - 86400; // Отняли день (в секундах)
		|		Иначе
		|			Возврат ЗначениеСвойства + 86400; // Добавили день (в секундах)
		|		КонецЕсли;
		|	// ======================================================
		|	// Для Шрифт.
		|	ИначеЕсли ТипСтрокой = ""System.Drawing.Font"" Тогда
		|		Возврат ""System.Drawing.Font"";
		|	// ======================================================
		|	// Для размера.
		|	ИначеЕсли ТипСтрокой = ""System.Drawing.Size"" Тогда
		|		Возврат ""System.Drawing.Size"";
		|	// Для положения.
		|	ИначеЕсли ТипСтрокой = ""System.Drawing.Point"" Тогда
		|		Возврат ""System.Drawing.Point"";
		|	// ======================================================
		|	// Для чисел.
		|	ИначеЕсли ТипСтрокой = ""System.Decimal"" Тогда
		|		Возврат ЗначениеСвойства + 2.6;
		|	ИначеЕсли ТипСтрокой = ""System.Int32"" Тогда
		|		Если ИмяСвойства = ""МаксимальнаяДлина"" Тогда
		|			Если ИмяТипаКонтрола = ""ПолеВыбора"" Тогда
		|				Возврат 2;
		|			Иначе
		|				Возврат ЗначениеСвойства - 2;
		|			КонецЕсли;
		|		Иначе
		|			Возврат ЗначениеСвойства + 2;
		|		КонецЕсли;
		|	ИначеЕсли ТипСтрокой = ""System.Single"" Тогда
		|		Возврат 2.6;
		|	// ======================================================
		|	// Для перечислений перебираем все значения перечисления.
		|	// Для курсора перебираем все значения курсора.
		|	// ======================================================
		|	// Для ВыделенныеДаты.
		|	ИначеЕсли ТипСтрокой = ""osfDesigner.MyBoldedDatesList"" Тогда
		|		Возврат ""osfDesigner.MyBoldedDatesList"";
		|	// ======================================================
		|	// Для ВыделенныйДиапазон.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.SelectionRange"" Тогда
		|		Возврат ""System.Windows.Forms.SelectionRange"";
		|	// ======================================================
		|	// Для ЕжегодныеДаты.
		|	ИначеЕсли ТипСтрокой = ""osfDesigner.MyAnnuallyBoldedDatesList"" Тогда
		|		Возврат ""osfDesigner.MyAnnuallyBoldedDatesList"";
		|	// ======================================================
		|	// Для ЕжемесячныеДаты.
		|	ИначеЕсли ТипСтрокой = ""osfDesigner.MyMonthlyBoldedDatesList"" Тогда
		|		Возврат ""osfDesigner.MyMonthlyBoldedDatesList"";
		|	// ======================================================
		|	// Для ГлавноеМеню.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.Menu+MenuItemCollection"" Тогда
		|		Возврат ""System.Windows.Forms.Menu+MenuItemCollection"";
		|	// ======================================================
		|	// Для Текст, ВыбранныйПуть и др.
		|	ИначеЕсли ТипСтрокой = ""System.String"" Тогда
		|		Если ИмяСвойства = ""Фильтр"" Тогда
		|			Если ИмяТипаКонтрола = ""НаблюдательФайловойСистемы"" Тогда
		|				Возврат ""Sales*200?.xls"";
		|			Иначе
		|				Возврат ""Файлы изображений (*.BMP;*.jpg;*.GIF)|*.BMP;*.jpg;*.GIF|All files (*.*)|*.*|Текстовые файлы (*.txt)|*.txt|Все файлы (*.*)|*.*"";
		|			КонецЕсли;
		|		ИначеЕсли ИмяСвойства = ""Маска"" Тогда
		|			Возврат ""(000) 000-0000"";
		|		ИначеЕсли ИмяСвойства = ""Путь"" Тогда
		|			Возврат ""C:\"";
		|		Иначе
		|			Возврат """" + ЗначениеСвойства + ""АбВгД"";
		|		КонецЕсли;
		|	// ======================================================
		|	// Для Изображение, ФоновоеИзображение.
		|	ИначеЕсли ТипСтрокой = ""System.Drawing.Image"" Тогда
		|		Возврат ""System.Drawing.Image"";
		|	// ======================================================
		|	// Для СписокИзображений, СписокБольшихИзображений, СписокМаленькихИзображений.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ImageList"" Тогда
		|		Возврат ""System.Windows.Forms.ImageList"";
		|	// ======================================================
		|	// Для Изображения.
		|	ИначеЕсли ТипСтрокой = ""osfDesigner.MyList"" Тогда
		|		Возврат ""osfDesigner.MyList"";
		|	// ======================================================
		|	// Для Узлы.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.TreeNodeCollection"" Тогда
		|		Возврат ""System.Windows.Forms.TreeNodeCollection"";
		|	// ======================================================
		|	// Для Значок.
		|	ИначеЕсли ТипСтрокой = ""osfDesigner.MyIcon"" Тогда
		|		Возврат ""osfDesigner.MyIcon"";
		|	// ======================================================
		|	// Для СимволПароля, СимволПриглашения.
		|	ИначеЕсли ТипСтрокой = ""System.Char"" Тогда
		|		Возврат ""System.Char"";
		|	// ======================================================
		|	// Для ОбластьСсылки.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.LinkArea"" Тогда
		|		Возврат ""System.Windows.Forms.LinkArea"";
		|	// ======================================================
		|	// Для Вкладки.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.TabControl+TabPageCollection"" Тогда
		|		Возврат ""System.Windows.Forms.TabControl+TabPageCollection"";
		|	// ======================================================
		|	// Для Кнопки.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ToolBar+ToolBarButtonCollection"" Тогда
		|		Возврат ""System.Windows.Forms.ToolBar+ToolBarButtonCollection"";
		|	// ======================================================
		|	// Для Подсказка.
		|	ИначеЕсли ТипСтрокой = ""System.Collections.Hashtable"" Тогда
		|		Возврат ""System.Collections.Hashtable"";
		|	// ======================================================
		|	// Для ПолеВыбора - Элементы.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ComboBox+ObjectCollection"" Тогда
		|		Возврат ""System.Windows.Forms.ComboBox+ObjectCollection"";
		|	// ======================================================
		|	// Для ПолеСписка - Элементы.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ListBox+ObjectCollection"" Тогда
		|		Возврат ""System.Windows.Forms.ListBox+ObjectCollection"";
		|	// ======================================================
		|	// Для СтилиТаблицы.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.GridTableStylesCollection"" Тогда
		|		Возврат ""System.Windows.Forms.GridTableStylesCollection"";
		|	// ======================================================
		|	// Для ВыбранныйОбъект.
		|	ИначеЕсли ТипСтрокой = ""System.Object"" Тогда
		|		Возврат ""System.Object"";
		|	// ======================================================
		|	// Для СписокЭлементов - Колонки.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ListView+ColumnHeaderCollection"" Тогда
		|		Возврат ""System.Windows.Forms.ListView+ColumnHeaderCollection"";
		|	// ======================================================
		|	// Для СписокЭлементов - Элементы.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ListView+ListViewItemCollection"" Тогда
		|		Возврат ""System.Windows.Forms.ListView+ListViewItemCollection"";
		|	// ======================================================
		|	// Для СтрокаСостояния - Панели.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.StatusBar+StatusBarPanelCollection"" Тогда
		|		Возврат ""System.Windows.Forms.StatusBar+StatusBarPanelCollection"";
		|	// ======================================================
		|	// Для Таблица - Колонки.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.DataGridViewColumnCollection"" Тогда
		|		Возврат ""System.Windows.Forms.DataGridViewColumnCollection"";
		|	// ======================================================
		|	// Для Таблица - СтильЗаголовковКолонок.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.DataGridViewCellStyle"" Тогда
		|		Возврат ""System.Windows.Forms.DataGridViewCellStyle"";
		|	// ======================================================
		|	// Для Форма - КнопкаОтмена.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.IButtonControl"" Тогда
		|		Возврат ""System.Windows.Forms.IButtonControl"";
		|	// ======================================================
		|	// Для Форма - Меню.
		|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.MainMenu"" Тогда
		|		Возврат ""System.Windows.Forms.MainMenu"";
		|	// ======================================================
		|	// Для Форма - Значок.
		|	ИначеЕсли ТипСтрокой = ""System.Drawing.Icon"" Тогда
		|		Возврат ""System.Drawing.Icon"";
		|	
		|	
		|	
		|	
		|	
		|	КонецЕсли;";
	Возврат Стр + Символы.ПС + "
	|	Сообщить("""" + ИмяТипаКонтрола + "" - "" + ИмяСвойства + "" - Не удалось сформировать значение"");
	|КонецФункции";
КонецФункции

Функция Команда1(ИмяФайла, Аргументы)
	ИнформацияЗапускаПроцесса1 = Ф.ИнформацияЗапускаПроцесса();
	ИнформацияЗапускаПроцесса1.ИмяФайла = ИмяФайла;
	ИнформацияЗапускаПроцесса1.Аргументы = Аргументы;
	ИнформацияЗапускаПроцесса1.СоздатьБезОкна = Истина;
	ИнформацияЗапускаПроцесса1.ИспользоватьОболочку = Ложь;
	ИнформацияЗапускаПроцесса1.СтильОкна = Ф.СтильОкнаПроцесса.Скрытое;
	ИнформацияЗапускаПроцесса1.ПеренаправитьСтандартныйВывод = Истина;

	Процесс1 = Ф.Процесс();
	Процесс1.НачальнаяИнформация = ИнформацияЗапускаПроцесса1;
	Процесс1.Начать();
	Если Не Процесс1.Завершен Тогда
		Стр1 = Процесс1.СтандартныйВывод.ПрочитатьСтроку();
		Пока Стр1 <> Неопределено Цикл
			Стр3 = "" + Стр1;
			Если (СтрНайти(Стр3, "!!!") > 0) 
				или (СтрНайти(Стр3, "{") > 0)  
				или (СтрНайти(Стр3, "Unhandled Exception:") > 0) 
				или (СтрНайти(Стр3, "Не удалось сформировать значение") > 0) 
				или (СтрНайти(Стр3, "Ошибка выгрузки") > 0)
				или (СтрНайти(Стр3, "Ошибка запуска") > 0) 
				или (СтрНайти(Стр3, "Свойства нет в сценарии") > 0 И (Не СтрНайти(Стр3, "Вкладки") > 0)) 
			Тогда
				Если (СтрНайти(Стр3, "{Width=") > 0) 
					или (СтрНайти(Стр3, "{X=") > 0)  
					или (СтрНайти(Стр3, "{Start") > 0)  
					или (СтрНайти(Стр3, "- Курсор - Свойства нет в сценарии") > 0)  
					или (СтрНайти(Стр3, "- Курсор - Ошибка выгрузки") > 0)  
					или (СтрНайти(Стр3, "- Стыковка - Свойства нет в сценарии") > 0)  
					или (СтрНайти(Стр3, "- Якорь - Свойства нет в сценарии") > 0)  
					или (СтрНайти(Стр3, "- ПервыйДеньНедели - Свойства нет в сценарии") > 0)  
					или (СтрНайти(Стр3, "- ГлубинаЦвета - Свойства нет в сценарии") > 0)  
					или (СтрНайти(Стр3, "DataGridViewCellStyle {") > 0)  
				Тогда
				Иначе
					СписокОшибок.Добавить(Стр3);
				КонецЕсли;
			КонецЕсли;
			ПолеВвода1.ДобавитьТекст(Стр3 + Символы.ПС);
			ПолеВвода1.НачалоВыделения = ПолеВвода1.ДлинаТекста - СтрДлина(Стр3 + Символы.ПС);
			ПолеВвода1.ПрокрутитьДоКурсора();
			Стр1 = Процесс1.СтандартныйВывод.ПрочитатьСтроку();
		КонецЦикла;
	КонецЕсли;
	Ф.ПередатьУправление();
КонецФункции//Команда1

Функция ПолучитьТекстШаблона()
	Возврат "
	|Перем Ф, ТекПуть, ПутьСценарий1, ПутьВыгрузка1, ПутьВыгрузка2, М_Событий;
	|Перем ДФ Экспорт;
	|
	|Функция Команда1(ИмяФайла, Аргументы, ИмяТипаКонтрола, ИмяСвойства)
	|	ИнформацияЗапускаПроцесса1 = Ф.ИнформацияЗапускаПроцесса();
	|	ИнформацияЗапускаПроцесса1.ИмяФайла = ИмяФайла;
	|	ИнформацияЗапускаПроцесса1.Аргументы = Аргументы;
	|	ИнформацияЗапускаПроцесса1.СоздатьБезОкна = Истина;
	|	ИнформацияЗапускаПроцесса1.ИспользоватьОболочку = Ложь;
	|	ИнформацияЗапускаПроцесса1.СтильОкна = Ф.СтильОкнаПроцесса.Скрытое;
	|	ИнформацияЗапускаПроцесса1.ПеренаправитьСтандартныйВывод = Истина;
	|
	|	ОшибкиЕсть = Ложь;
	|	Процесс1 = Ф.Процесс();
	|	Процесс1.НачальнаяИнформация = ИнформацияЗапускаПроцесса1;
	|	Процесс1.Начать();
	|	Если Не Процесс1.Завершен Тогда
	|		Стр1 = Процесс1.СтандартныйВывод.ПрочитатьСтроку();
	|		Пока Стр1 <> Неопределено Цикл
	|			Стр3 = """" + Стр1;
	|			Если (СтрНайти(Стр3, ""!!!"") > 0) 
	|				или (СтрНайти(Стр3, ""{"") > 0)  
	|				или (СтрНайти(Стр3, ""Unhandled Exception:"") > 0) 
	|			Тогда
	|				Сообщить(Стр3 + ""  "" + ИмяТипаКонтрола + "" - "" + ИмяСвойства);
	|				ОшибкиЕсть = Истина;
	|			КонецЕсли;
	|			Стр1 = Процесс1.СтандартныйВывод.ПрочитатьСтроку();
	|		КонецЦикла;
	|	КонецЕсли;
	|	Если ОшибкиЕсть Тогда
	|		Сообщить("""" + ИмяТипаКонтрола + "" - "" + ИмяСвойства + "" - Ошибка запуска"");
	|	КонецЕсли;
	|	Ф.ПередатьУправление();
	|КонецФункции//Команда1
	|
	|Процедура Фоновое1(параметр1, параметр2) Экспорт
	|	Контекст = Новый Структура(""Сценарий1"", параметр1);
	|	ЗагрузитьСценарий(ОбъединитьПути(ТекПуть,""ФормаДизайнера.os""), Контекст);
	|КонецПроцедуры
	|
	|Процедура ПроверкаСвойства(ИмяТипаКонтрола, ИмяСвойства) Экспорт
	|	// ==================================================================
	|	// Создадим на форме контрол и установим для него значение свойства.
	|	ИмяКонтрола = ДФ.ДобавитьКонтрол(ИмяТипаКонтрола);
	|	ТипСтрокой = ДФ.ПолучитьТипСвойства(ИмяКонтрола, ИмяСвойства);
	|	ЗначениеСвойстваПоУмолчанию = ДФ.ПолучитьЗначениеСвойства(ИмяКонтрола, ИмяСвойства);
	|	Сообщить(""ЗначениеСвойстваПоУмолчанию = "" + ЗначениеСвойстваПоУмолчанию);
	|	Если ТипСтрокой = ""System.Windows.Forms.Cursor"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.Курсоры() Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.FormBorderStyle"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.СтильГраницыФормы Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.FormStartPosition"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.НачальноеПоложениеФормы Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.RichTextBoxScrollBars"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ПолосыПрокрутки Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.CheckState"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.СостояниеФлажка Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.DataGridViewColumnHeadersHeightSizeMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимВысотыЗаголовковКолонок Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.DataGridViewSelectionMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимВыбораТаблицы Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.DataGridViewAutoSizeRowsMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимАвтоРазмераСтрок Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""osfDesigner.DataGridViewAutoSizeColumnsMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимАвтоРазмераКолонок Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""osfDesigner.DataGridViewRowHeadersWidthSizeMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимШириныЗаголовковСтрок Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ColumnHeaderStyle"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.СтильЗаголовкаКолонки Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.SortOrder"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ПорядокСортировки Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""osfDesigner.View"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимОтображения Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ListViewAlignment"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ВыравниваниеВСпискеЭлементов Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ItemActivation"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.АктивацияЭлемента Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.PropertySort"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.СортировкаСвойств Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.SelectionMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимВыбора Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.PictureBoxSizeMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимРазмераПоляКартинки Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ImageLayout"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РазмещениеИзображения Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.DateTimePickerFormat"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ФорматПоляКалендаря Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.LeftRightAlignment"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ЛевоеПравоеВыравнивание Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ComboBoxStyle"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.СтильПоляВыбора Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.DrawMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимРисования Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.CharacterCasing"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РегистрСимволов Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ScrollBars"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ПолосыПрокрутки Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.Appearance"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.Оформление Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.TabSizeMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимРазмераВкладок Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.TabAppearance"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ОформлениеВкладок Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.Day"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.День Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.DockStyle"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.СтильСтыковки Цикл
	|			Если СтрНайти(ИмяКонтрола, ""Разделитель"") > 0 Тогда
	|				Если Не (ЗначениеСвойства = 5 или ЗначениеСвойства = 0) Тогда
	|					ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|				КонецЕсли;
	|			Иначе
	|				ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|			КонецЕсли;
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.AnchorStyles"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.СтилиПривязки Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Drawing.ContentAlignment"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ВыравниваниеСодержимого Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.FlatStyle"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ПлоскийСтиль Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.DialogResult"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РезультатДиалога Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""osfDesigner.ColorDepth"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ГлубинаЦвета Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""osfDesigner.DockStyle"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.СтильСтыковки Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.BorderStyle"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.СтильГраницы Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""osfDesigner.SpecialFolder"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ОсобаяПапка Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.HorizontalAlignment"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ГоризонтальноеВыравнивание Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.MaskFormat"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ФорматМаски Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.InsertKeyMode"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.РежимВставки Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.IO.NotifyFilters"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ФильтрыУведомления Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.LinkBehavior"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ПоведениеСсылки Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.TabAlignment"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ВыравниваниеВкладок Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ToolBarTextAlign"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ВыравниваниеТекстаВПанелиИнструментов Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	ИначеЕсли ТипСтрокой = ""System.Windows.Forms.ToolBarAppearance"" Тогда
	|		Для Каждого ЗначениеСвойства Из Ф.ОформлениеПанелиИнструментов Цикл
	|			ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию);
	|		КонецЦикла;
	|	Иначе
	|		ЗначениеСвойства = ПодстановкаЗначенийСвойств(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства);
	|		ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, Неопределено)
	|	КонецЕсли;
	|	// ==================================================================
	|	// Закроем дизайнер.
	|	// ДФ.ЗакрытьДизайнер();
	|КонецПроцедуры
	|
	|Процедура ЦиклПроверкиСвойства(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства, ЗначениеСвойства, ЗначениеСвойстваПоУмолчанию)
	|	Сообщить(""ЗначениеСвойства = "" + ЗначениеСвойства);
	|	ДФ.УстановитьСвойство(ИмяКонтрола, ИмяСвойства, ЗначениеСвойства);
	|	// ==================================================================
	|	// Сформируем сценарий и запустим его.
	|	ДФ.СформироватьСценарий(ПутьСценарий1);
	|	ТекстДок3 = Новый ТекстовыйДокумент;
	|	ТекстДок3.Прочитать(ПутьСценарий1);
	|	Стр1 = ТекстДок3.ПолучитьТекст();
	|	Стр1 = СтрЗаменить(Стр1, ""Ф.ЗапуститьОбработкуСобытий();"", ""// Ф.ЗапуститьОбработкуСобытий();"");
	|	Если ИмяСвойства = ""ToolTip на Подсказка"" Тогда
	|		// УстановитьПодсказку(ПолеВвода1
	|		Если Не СтрНайти(Стр1, "".УстановитьПодсказку("" + ИмяКонтрола) > 0 Тогда
	|			Если Не ЗначениеСвойстваПоУмолчанию = Неопределено Тогда
	|			Иначе
	|				Сообщить("""" + ИмяТипаКонтрола + "" - "" + ИмяСвойства + "" - Свойства нет в сценарии"");
	|			КонецЕсли;
	|		КонецЕсли;
	|	Иначе
	|		Если Не СтрНайти(Стр1, ИмяКонтрола + ""."" + ИмяСвойства) > 0 Тогда
	|			Если Не ЗначениеСвойстваПоУмолчанию = Неопределено Тогда
	|			Иначе
	|				Сообщить("""" + ИмяТипаКонтрола + "" - "" + ИмяСвойства + "" - Свойства нет в сценарии"");
	|			КонецЕсли;
	|		КонецЕсли;
	|	КонецЕсли;
	|	ТекстДок3.УстановитьТекст(Стр1);
	|	ТекстДок3.Записать(ПутьСценарий1, ""UTF-8"");
	|	Ф.ПередатьУправление();
	|	Команда1(""""""C:\Program Files\OneScript\bin\oscript.exe"""""", ПутьСценарий1, ИмяТипаКонтрола, ИмяСвойства);
	|	// ==================================================================
	|	// Сохраним форму в osd. Загрузим форму из osd. Снова сохраним форму в osd. Сравним две сохраненки osd.
	|	ДФ.СохранитьФорму(ПутьВыгрузка1);
	|	ДФ.ОткрытьФорму(ПутьВыгрузка1);
	|	ДФ.СохранитьФорму(ПутьВыгрузка2);
	|
	|	ТекстДок1 = Новый ТекстовыйДокумент;
	|	ТекстДок1.Прочитать(ПутьВыгрузка1);
	|	Стр1 = ТекстДок1.ПолучитьТекст();
	|	Стр1 = СтрЗаменить(Стр1, ПутьВыгрузка1, """");
	|	ТекстДок2 = Новый ТекстовыйДокумент;
	|	ТекстДок2.Прочитать(ПутьВыгрузка2);
	|	Стр2 = ТекстДок2.ПолучитьТекст();
	|	Стр2 = СтрЗаменить(Стр2, ПутьВыгрузка2, """");
	|	Если Стр1 = Стр2 Тогда
	|		Сообщить("""" + ИмяТипаКонтрола + "" - "" + ИмяСвойства + "" - Выгрузки равны"");
	|	Иначе
	|		Сообщить("""" + ИмяТипаКонтрола + "" - "" + ИмяСвойства + "" - Ошибка выгрузки"");
	|	КонецЕсли;
	|КонецПроцедуры
	|
	|Функция ПодстановкаЗначенийСвойств(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства)
	|
	|Таймер = ТекущаяУниверсальнаяДатаВМиллисекундах();
	|ПодключитьВнешнююКомпоненту(""C:\444\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll"");
	|Ф = Новый ФормыДляОдноСкрипта();
	|
	|ТекПуть = Новый Файл(ТекущийСценарий().Источник).Путь;
	|
	|ПутьСценарий1 = ОбъединитьПути(ТекПуть,""Сценарий1.os"");
	|ПутьВыгрузка1 = ОбъединитьПути(ТекПуть,""Выгрузка1.osd"");
	|ПутьВыгрузка2 = ОбъединитьПути(ТекПуть,""Выгрузка2.osd"");
	|
	|М_Событий = Новый Массив();// Массив имен событий.
	|
	|МассивСвойств = Новый Массив();
	|
	|ИмяТипаКонтрола = ;
	|
	|// Запустим дизайнер.
	|ДФ = Неопределено;
	|МассивПараметров = Новый Массив(1);
	|МассивПараметров[0] = ЭтотОбъект;
	|ФоновыеЗадания.Выполнить(ЭтотОбъект, ""Фоновое1"", МассивПараметров);
	|
	|// Дождемся подключения библиотеки дизайнера.
	|Пока ДФ = Неопределено Цикл
	|	Приостановить(500);
	|КонецЦикла;
	|Приостановить(4000);
	|// Дождемся запуска дизайнера.
	|Пока Не ДФ.ДизайнерОткрыт() Цикл
	|	Приостановить(500);
	|КонецЦикла;
	|Приостановить(2000);
	|
	|Если ДФ.ВизуальныеСтилиФормВключены Тогда
	|	Сообщить(""Перед тестированием отключите в дизайнере визуальные стили для форм."");
	|	Сообщить(""Инструменты - Параметры - Визуальные стили - Включить визуальные стили для форм. Снимите галочку."");
	|	ЗавершитьРаботу(10);
	|КонецЕсли;
	|
	|Для А1 = 0 По МассивСвойств.ВГраница() Цикл
	|	ИмяСвойства = МассивСвойств[А1];
	|	ПроверкаСвойства(ИмяТипаКонтрола, ИмяСвойства);
	|	ДФ.УдалитьКонтролы();
	|	Если ИмяТипаКонтрола = ""Форма"" Тогда
	|		ДФ.ОткрытьФорму(ОбъединитьПути(ТекПуть,""Выгрузка0.osd""));
	|	КонецЕсли;
	|КонецЦикла;
	|
	|Сообщить(""=============================================================================================="")
	|;";
КонецФункции

Процедура СоздатьФайлВыгрузка0()
	ПутьФайла = ОбъединитьПути(ТекПуть,"ФайлыТеста\Выгрузка0.osd");
	ФайлНаДиске = Новый Файл(ПутьФайла);
	Если Не ФайлНаДиске.Существует() Тогда
		Стр1 = "
		|[<Конструкторы]
		|Форма_0 = Ф.Форма();
		|[Конструкторы>]
		|[<Свойства]
		|[<Форма_0]
		|Форма_0.Размер = Ф.Размер(670, 600);
		|Форма_0.Путь = """ + ПутьФайла + """;
		|Форма_0.Текст = ""Форма_0"";
		|[Форма_0>]
		|[Свойства>]
		|";
		ТекстДок5 = Новый ТекстовыйДокумент;
		ТекстДок5.УстановитьТекст(Стр1);
		ТекстДок5.Записать(ПутьФайла, "UTF-8");
		Приостановить(1000);
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьФайлЗапускаДизайнера()
	ПутьФайла = ОбъединитьПути(ТекПуть,"ФайлыТеста\ФормаДизайнера.os");
	ФайлНаДиске = Новый Файл(ПутьФайла);
	Если Не ФайлНаДиске.Существует() Тогда
		Стр1 = "
		|ПодключитьВнешнююКомпоненту(""C:\444\111\OneScriptFormsDesigner\OneScriptFormsDesigner\bin\Debug\OneScriptFormsDesigner.dll"");
		|ДФ = Новый ДизайнерФормДляОдноСкрипта();
		|Сценарий1.ДФ = ДФ;
		|
		|ДФ.Дизайнер();
		|";
		ТекстДок4 = Новый ТекстовыйДокумент;
		ТекстДок4.УстановитьТекст(Стр1);
		ТекстДок4.Записать(ПутьФайла, "UTF-8");
		Приостановить(1000);
	КонецЕсли;
КонецПроцедуры

Таймер = ТекущаяУниверсальнаяДатаВМиллисекундах();

ТекПуть = Новый Файл(ТекущийСценарий().Источник).Путь;

ПутьКаталога = ОбъединитьПути(ТекПуть,"ФайлыТеста");
КаталогНаДиске = Новый Файл(ПутьКаталога);
Если Не КаталогНаДиске.Существует() Тогда
	СоздатьКаталог(ПутьКаталога);
КонецЕсли;
Приостановить(1000);
УдалитьФайлы(ПутьКаталога, "*.os");

СоздатьФайлЗапускаДизайнера();
СоздатьФайлВыгрузка0();

КаталогСправки = "C:\444\OneScriptFormsru";// без слэша в конце

ПодключитьВнешнююКомпоненту("C:\444\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll");
Ф = Новый ФормыДляОдноСкрипта();
Форма1 = Ф.Форма();
Форма1.Текст = "Тест OneScriptFormsDesigner.dll";
Форма1.Ширина = 1100;
Форма1.Высота = 600;
Форма1.Отображать = Истина;
Форма1.Показать();
// Форма1.СостояниеОкна = Ф.СостояниеОкнаФормы.Свернутое;

ПолеВвода1 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода1.МногострочныйРежим = Истина;
ПолеВвода1.Стыковка = Ф.СтильСтыковки.Заполнение;
ПолеВвода1.ЦветФона = Ф.Цвет().Черный;
ПолеВвода1.ОсновнойЦвет = Ф.Цвет().БледноЗеленый;
ПолеВвода1.ПолосыПрокрутки = Ф.ПолосыПрокрутки.Обе;
ПолеВвода1.ПринятиеВозврат = Истина;
ПолеВвода1.Перенос = Ложь;
ПолеВвода1.РегистрСимволов = Ф.РегистрСимволов.Стандартный;

СписокОшибок = Новый СписокЗначений;
СоздатьСпискиСвойств();
СтрМассиваСобытий = СоздатьСтрокуМассиваСобытий();

СписокКонтролов = Новый СписокЗначений();
	СписокКонтролов.Добавить("ВертикальнаяПрокрутка");
	СписокКонтролов.Добавить("Вкладка");
	СписокКонтролов.Добавить("ГлавноеМеню");
	СписокКонтролов.Добавить("ГоризонтальнаяПрокрутка");
	СписокКонтролов.Добавить("Дерево");
	СписокКонтролов.Добавить("ДиалогВыбораКаталога");
	СписокКонтролов.Добавить("ДиалогВыбораЦвета");
	СписокКонтролов.Добавить("ДиалогВыбораШрифта");
	СписокКонтролов.Добавить("ДиалогОткрытияФайла");
	СписокКонтролов.Добавить("ДиалогСохраненияФайла");
	СписокКонтролов.Добавить("ЗначокУведомления");
	СписокКонтролов.Добавить("ИндикаторВертикальный");
	СписокКонтролов.Добавить("ИндикаторГоризонтальный");
	СписокКонтролов.Добавить("Календарь");
	СписокКонтролов.Добавить("Кнопка");
	СписокКонтролов.Добавить("МаскаПоляВвода");
	СписокКонтролов.Добавить("НаблюдательФайловойСистемы");
	СписокКонтролов.Добавить("Надпись");
	СписокКонтролов.Добавить("НадписьСсылка");
	СписокКонтролов.Добавить("Панель");
	СписокКонтролов.Добавить("ПанельВкладок");
	СписокКонтролов.Добавить("ПанельИнструментов");
	СписокКонтролов.Добавить("Переключатель");
	СписокКонтролов.Добавить("Подсказка");
	СписокКонтролов.Добавить("ПолеВвода");
	СписокКонтролов.Добавить("ПолеВыбора");
	СписокКонтролов.Добавить("ПолеКалендаря");
	СписокКонтролов.Добавить("ПолеКартинки");
	СписокКонтролов.Добавить("ПолеСписка");
	СписокКонтролов.Добавить("ПользовательскийЭлементУправления");
	СписокКонтролов.Добавить("Разделитель");
	СписокКонтролов.Добавить("РамкаГруппы");
	СписокКонтролов.Добавить("РегуляторВверхВниз");
	СписокКонтролов.Добавить("СеткаДанных");
	СписокКонтролов.Добавить("СеткаСвойств");
	СписокКонтролов.Добавить("СписокИзображений");
	СписокКонтролов.Добавить("СписокЭлементов");
	СписокКонтролов.Добавить("СтрокаСостояния");
	СписокКонтролов.Добавить("Таблица");
	СписокКонтролов.Добавить("Таймер");
	СписокКонтролов.Добавить("Флажок");
	СписокКонтролов.Добавить("Форма");
	СписокКонтролов.Добавить("ФорматированноеПолеВвода");

Для А = 0 По СписокКонтролов.Количество() - 1 Цикл
	ИмяТипаКонтрола = СписокКонтролов.Получить(А).Значение;
	
	// Получим текст для файла шаблона.
	Стр1 = ПолучитьТекстШаблона();

	ПодстрокаПоиска = "М_Событий = Новый Массив();// Массив имен событий.";
	ПодстрокаЗамены = СтрМассиваСобытий;
	Стр1 = СтрЗаменить(Стр1, ПодстрокаПоиска, ПодстрокаЗамены);
	
	ПодстрокаПоиска = "ИмяТипаКонтрола = ;";
	ПодстрокаЗамены = "ИмяТипаКонтрола = """ + ИмяТипаКонтрола + """;";
	Стр1 = СтрЗаменить(Стр1, ПодстрокаПоиска, ПодстрокаЗамены);
	
	ПодстрокаПоиска = "МассивСвойств = Новый Массив();";
	ПодстрокаЗамены = "МассивСвойств = Новый Массив();" + Символы.ПС + ЗаполнитьМассивСвойств(ИмяТипаКонтрола);
	Стр1 = СтрЗаменить(Стр1, ПодстрокаПоиска, ПодстрокаЗамены);
	
	ПодстрокаПоиска = "Функция ПодстановкаЗначенийСвойств(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства)";
	ПодстрокаЗамены = "Функция ПодстановкаЗначенийСвойств(ИмяТипаКонтрола, ИмяКонтрола, ИмяСвойства)" + Символы.ПС + СформироватьЗначениеСвойства(ИмяТипаКонтрола);
	Стр1 = СтрЗаменить(Стр1, ПодстрокаПоиска, ПодстрокаЗамены);
	
	// Сохраним шаблон в новый тестовый файл.
	ТекстДок1 = Новый ТекстовыйДокумент;
	ТекстДок1.УстановитьТекст(Стр1);
	ИмяФайлаТеста = ОбъединитьПути(ТекПуть,"ФайлыТеста\" + ИмяТипаКонтрола + ".os");
	ТекстДок1.Записать(ИмяФайлаТеста, "UTF-8");
	
	// Запустим тестовый файл.
	Команда1("""C:\Program Files\OneScript\bin\oscript.exe""", ИмяФайлаТеста);
КонецЦикла;

ПолеВвода1.ДобавитьТекст("==============================================================================================" + Символы.ПС);
ПолеВвода1.ДобавитьТекст("Тест выполнен за: " + ((ТекущаяУниверсальнаяДатаВМиллисекундах()-Таймер)/1000)/60 + " мин." + " " + ТекущаяДата() + Символы.ПС);
ПолеВвода1.ДобавитьТекст("Ошибок = " + СписокОшибок.Количество() + Символы.ПС);
Для А = 0 По СписокОшибок.Количество() - 1 Цикл
	ПолеВвода1.ДобавитьТекст("" + СписокОшибок.Получить(А).Значение + Символы.ПС);
КонецЦикла;
Форма1.СостояниеОкна = Ф.СостояниеОкнаФормы.Стандартное;

Ф.ЗапуститьОбработкуСобытий();
