namespace osfDesigner
{
    public enum SpecialFolder
    {
        ВременныеФайлыИнтернета = 32,
        ДанныеПриложений = 26,
        ДанныеПриложенийПользователя = 28,
        Избранное = 6,
        История = 34,
        КаталогЗапуска = 7,
        КаталогОтправить = 9,
        КаталогПуск = 11,
        КаталогСистема = 37,
        Куки = 33,
        Личное = 5,
        МоиРисунки = 39,
        МойКомпьютер = 17,
        МояМузыка = 13,
        НедавниеДокументы = 8,
        ОбщиеДанныеПриложений = 35,
        ОбщиеПрограммныеФайлы = 43,
        ПрограммныеФайлы = 38,
        Программы = 2,
        РабочийСтол = 0,
        ФайлыРабочегоСтола = 16,
        Шаблоны = 21
    }
}
